[{"items":[{"id":"yk8LHAAACAAJ","volumeInfo":{"title":"Collins Atlas of 20th Century History","authors":["Richard Overy"],"publisher":"Collins Reference","publishedDate":"2006-08-15","description":"A single-volume reference to answer all your questions about history's most complex century. The 20th century was a time of massive political upheaval and rapid transition that included the Age of Imperialism, Lenin, the First World War, the rise of Hitler, the Second World War, decolonization, the founding of the United Nations, the collapse of Communism, and the Gulf Wars. The Collins Atlas of 20th Century History provides a new approach to understanding the century's major developments, from the height of the Imperial Age to the challenges of the post-Cold War era. Here is a visual presentation of an incredibly eventful 100 years, a tour through ten decades of conflict, hope, and innovation. Maps and graphics trace the rise and fall of empires and dictatorships, the hope for democracy, and the social and political change around the world. More than 200 full-color maps, diagrams, and timelines Edited by 20th century historian Richard Overy Comprehensive coverage of all areas of the world Examination of key battles and events Internet links for further research For anyone with an interest in the history, society, politics, warfare, and culture of the world, the Collins Atlas of 20th Century History is a perfect companion.","industryIdentifiers":[{"type":"ISBN_10","identifier":"006089072X"},{"type":"ISBN_13","identifier":"9780060890728"}],"pageCount":192,"imageLinks":{"thumbnail":"http://books.google.com/books/content?id=yk8LHAAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"}},"searchInfo":{"textSnippet":"Here is a visual presentation of an incredibly eventful 100 years, a tour through ten decades of conflict, hope, and innovation."}}]},{},{"items":[{"id":"-wFtjgEACAAJ","volumeInfo":{"title":"Hillbilly Elegy","authors":["J. D. Vance"],"publisher":"Harper","publishedDate":"2016-06-28","industryIdentifiers":[{"type":"ISBN_10","identifier":"0062300547"},{"type":"ISBN_13","identifier":"9780062300546"}],"pageCount":352,"imageLinks":{"thumbnail":"http://books.google.com/books/content?id=-wFtjgEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"}},"searchInfo":{"textSnippet":"In Hillbilly Elegy, J.D. Vance tells the true story of what a social, regional, and class decline feels like when you were born with it hanging around your neck. The Vance family story began with hope in postwar America."}}]},{"items":[{"id":"P-JUMAEACAAJ","volumeInfo":{"title":"General Chemistry: The Essential Concepts","authors":["Raymond Chang","Kenneth Goldsby"],"publisher":"McGraw-Hill Education","publishedDate":"2013-01-07","description":"The seventh edition of General Chemistry continues the tradition of presenting only the material that is essential for a one-year general chemistry course. It strikes a balance between theory and application by incorporating real-world examples; helping students visualize the three-dimensional atomic and molecular structures that are the basis of chemical activity; and developing problem-solving and critical thinking skills. Although the seventh edition incorporates many impressive features, such as conceptual idea review, animations correlated to the text, and hand-sketched worked examples, General Chemistry is still 200 to 300 pages shorter and much less expensive than other two-semester textbooks. Dr. Chang and Dr. Goldsby’ concise-but-thorough approach will appeal to efficiency-minded instructors and value-conscious students.","industryIdentifiers":[{"type":"ISBN_10","identifier":"0073402753"},{"type":"ISBN_13","identifier":"9780073402758"}],"pageCount":864,"imageLinks":{"thumbnail":"http://books.google.com/books/content?id=P-JUMAEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"}},"searchInfo":{"textSnippet":"The seventh edition of General Chemistry continues the tradition of presenting only the material that is essential for a one-year general chemistry course."}}]},{"items":[{"id":"FUNBpwAACAAJ","volumeInfo":{"title":"Film Art: An Introduction","authors":["Kristin Thompson","David Bordwell"],"publisher":"McGraw-Hill Education","publishedDate":"2012-07-06","description":"Film is an art form with a language and an aesthetic all its own. Since 1979, David Bordwell and Kristin Thompson's Film Art has been the best-selling and most widely respected introduction to the analysis of cinema. Taking a skills-centered approach supported by examples from many periods and countries, the authors help students develop a core set of analytical skills that will enrich their understanding of any film, in any genre. In-depth examples deepen students' appreciation for how creative choices by filmmakers affect what viewers experience and how they respond. Film Art is generously illustrated with more than 1,000 frame enlargements taken directly from completed films, providing concrete illustrations of key concepts. Along with updated examples and expanded coverage of digital filmmaking, the tenth edition also offers Connect for Film Art, a digital solution that includes multimedia tutorials along with web-based assignment and assessment tools.","industryIdentifiers":[{"type":"ISBN_10","identifier":"0073535109"},{"type":"ISBN_13","identifier":"9780073535104"}],"pageCount":544,"imageLinks":{"thumbnail":"http://books.google.com/books/content?id=FUNBpwAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"}},"searchInfo":{"textSnippet":"Along with updated examples and expanded coverage of digital filmmaking, the tenth edition also offers Connect for Film Art, a digital solution that includes multimedia tutorials along with web-based assignment and assessment tools."}}]},{"items":[{"id":"ZwtZAAAAYAAJ","volumeInfo":{"title":"Deux Mondes","authors":["Tracy D. Terrell","Mary B Rogers","Betsy J. Kerr","Guy Spielmann"],"publisher":"McGraw-Hill Humanities/Social Sciences/Languages","publishedDate":"2008-01-15","description":"Deux mondes is widely regarded as the most communicative text available for beginning French courses. Based on the Natural Approach developed by Tracy Terrell and Stephen Krashen, this text offers beginning language students a way to develop language proficiency (especially in listening and speaking) that allows them to participate in real conversations at a very early stage. The Natural Approach in general, and Deux mondes, Sixth Edition in particular, present material inductively (so that the activities drive the grammar), students quickly become excited about their rapid growth in comprehension and vocabulary acquisition and enjoy speaking in the non-threatening environment made possible by the activity formats.","industryIdentifiers":[{"type":"ISBN_10","identifier":"0073535443"},{"type":"ISBN_13","identifier":"9780073535449"}],"pageCount":544,"imageLinks":{"thumbnail":"http://books.google.com/books/content?id=ZwtZAAAAYAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"}},"searchInfo":{"textSnippet":"Based on the Natural Approach developed by Tracy Terrell and Stephen Krashen, this text offers beginning language students a way to develop language proficiency (especially in listening and speaking) that allows them to participate in real ..."}}]},{"items":[{"id":"dimmMAEACAAJ","volumeInfo":{"title":"WBLM for Deux mondes (Cahier d'exercices)","authors":["Françoise Santore","Tracy Terrell","Sanford Schane","Betsy Kerr","Mary Rogers"],"publisher":"McGraw-Hill Education","publishedDate":"2012-01-13","description":"This combined workbook/laboratory manual contains both acquisition activities and practice activities for use outside the classroom. It also contains the activities for the film, Le Chemin du retour. The Answer Key at the end of the print workboo/lab manual (Cahier) allows students to correct many of the activities themselves. The workbook/lab manual (Cahier) activities and the related audio recordings are also accessible in Connect French. In the online version, many of the activities are auto-graded, giving students instant feedback. In addition, each chapter features two audio/video chat activities and the new Les Francophones sur le vif video series (filmed specifically for Deux mondes) and the related activities.","industryIdentifiers":[{"type":"ISBN_10","identifier":"0077412702"},{"type":"ISBN_13","identifier":"9780077412708"}],"pageCount":256,"imageLinks":{"thumbnail":"http://books.google.com/books/content?id=dimmMAEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"}},"searchInfo":{"textSnippet":"This combined workbook/laboratory manual contains both acquisition activities and practice activities for use outside the classroom."}}]},{},{"items":[{"id":"_wqDoAEACAAJ","volumeInfo":{"title":"Chemistry","authors":["Raymond Chang","Kenneth Goldsby"],"publisher":"McGraw-Hill Education","publishedDate":"2015-01-08","description":"Chang's best-selling general chemistry textbook takes a traditional approach and is often considered a student and teacher favorite. The book features a straightforward, clear writing style and proven problem-solving strategies. It continues the tradition of providing a firm foundation in chemical concepts and principles while presenting a broad range of topics in a clear, concise manner. The tradition of Chemistry has a new addition with co-author, Kenneth Goldsby from Florida State University, adding variations to the 12th edition. The organization of the chapter order has changed with nuclear chemistry moving up in the chapter order.","industryIdentifiers":[{"type":"ISBN_10","identifier":"0078021510"},{"type":"ISBN_13","identifier":"9780078021510"}],"pageCount":1168,"imageLinks":{"thumbnail":"http://books.google.com/books/content?id=_wqDoAEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"}},"searchInfo":{"textSnippet":"Chang&#39;s best-selling general chemistry textbook takes a traditional approach and is often considered a student and teacher favorite. The book features a straightforward, clear writing style and proven problem-solving strategies."}}]},{"items":[{"id":"j50KAAAACAAJ","volumeInfo":{"title":"Histoire D'Une Revanche","authors":["Louise C. Seibert","Lester G. Crocker"],"publisher":"Prentice Hall","publishedDate":"1992-04-01","industryIdentifiers":[{"type":"ISBN_10","identifier":"0130340421"},{"type":"ISBN_13","identifier":"9780130340429"}],"pageCount":194,"imageLinks":{"thumbnail":"http://books.google.com/books/content?id=j50KAAAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"}}}]},{"items":[{"id":"Bt8CAAAACAAJ","volumeInfo":{"title":"Jenney's First Year Latin","authors":["Charles Jenney","Eric C. Baade","Thomas K. Burgess"],"publisher":"Pearson Prentice Hall","publishedDate":"1989-05-01","description":"Praised by teachers for many years, this format is now easier to manage. Passages are carefully controlled to use only vocabulary and syntax already taught and tested. Reading-skills instruction and translation help prepare students for second-year Latin. Twenty lessons formerly in Level I are now at the beginning of Level II, thereby providing better overall pacing.","industryIdentifiers":[{"type":"ISBN_10","identifier":"0133193284"},{"type":"ISBN_13","identifier":"9780133193282"}],"pageCount":579,"imageLinks":{"thumbnail":"http://books.google.com/books/content?id=Bt8CAAAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"}},"searchInfo":{"textSnippet":"Praised by teachers for many years, this format is now easier to manage."}}]},{"items":[{"id":"p7WDMAEACAAJ","volumeInfo":{"title":"Miller and Levine Biology 2014 Student Edition Grade 10","authors":["Kenneth Raymond Miller","Joseph S. Levine","Prentice-Hall, Inc","Pearson Education, Inc"],"publisher":"Prentice Hall","publishedDate":"2012-08-10","description":"A Multilingual glossary can help introduce critical academic vocabulary to learners of any age in their native language, opening up a whole new world of understanding.","industryIdentifiers":[{"type":"ISBN_10","identifier":"0133235742"},{"type":"ISBN_13","identifier":"9780133235746"}],"pageCount":64,"imageLinks":{"thumbnail":"http://books.google.com/books/content?id=p7WDMAEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"}},"searchInfo":{"textSnippet":"Miller &amp; Levine Biology Curriculum - High School The respected author team of Ken Miller and Joe Levine are back with a new edition of biology books to inspire students to interact with trusted and up-to-date biology content."}}]},{"items":[{"id":"wyOzoQEACAAJ","volumeInfo":{"title":"University Physics With Modern Physics","authors":["Hugh D. Young","Roger A. Freedman"],"publisher":"Addison-Wesley","publishedDate":"2014-12-30","description":"Note: You are purchasing a standalone product; MasteringPhysics does not come packaged with this content. Students, if interested in purchasing this title with MasteringPhysics, ask your instructor for the correct package ISBN and Course ID. Instructors, contact your Pearson representative for more information. If you would like to purchase both the physical text and MasteringPhysics, search for: 0321982584/9780321982582 University Physics with Modern Physics Plus MasteringPhysics with eText -- Access Card Package, 14/e Package consists of: 0321973615/ 9780321973610University Physics with Modern Physics, 14/e 0321997751/ 9780321997753 MasteringPhysics with Pearson eText -- ValuePack Access Card -- for University Physics with Modern Physics, 14/e For courses in calculus-based physics. The benchmark for clarity and rigor, influenced by the latest in education research. Since its first edition, \"University Physics\" has been revered for its emphasis on fundamental principles and how to apply them. This text is known for its clear and thorough narrative, as well as its uniquely broad, deep, and thoughtful sets of worked examples that provide students with key tools for developing both conceptual understanding and problem-solving skills. The Fourteenth Edition improves the defining features of the text while adding new features influenced by education research to teach the skills needed by today s students. A focus on visual learning, new problem types, and pedagogy informed by MasteringPhysics metadata headline the improvements designed to create the best learning resource for physics students. Also available with MasteringPhysics MasteringPhysics(r) from Pearson is the leading online homework, tutorial, and assessment system, designed to improve results by engaging students before, during, and after class with powerful content. Instructors ensure students arrive ready to learn by assigning educationally effective content before class and encourage critical thinking and retention with in-class resources such as Learning Catalytics. Students can further master concepts after class through traditional and adaptive homework assignments that provide hints and answer-specific feedback. The Mastering gradebook records scores for all automatically graded assignments in one place, while diagnostic tools give instructors access to rich data to assess student understanding and misconceptions. Mastering brings learning full circle by continuously adapting to each student and making learning more personal than ever before, during, and after class. \"","industryIdentifiers":[{"type":"ISBN_10","identifier":"0133978001"},{"type":"ISBN_13","identifier":"9780133978001"}],"pageCount":640,"imageLinks":{"thumbnail":"http://books.google.com/books/content?id=wyOzoQEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"}},"searchInfo":{"textSnippet":"This text is known for its clear and thorough narrative, as well as its uniquely broad, deep, and thoughtful sets of worked examples that provide students with key tools for developing both conceptual understanding and problem-solving ..."}}]},{"items":[{"id":"WsjDoQEACAAJ","volumeInfo":{"title":"University Physics With Modern Physics","authors":["Hugh D. Young","Roger A. Freedman"],"publisher":"Addison-Wesley","publishedDate":"2014-12-31","description":"Note: You are purchasing a standalone product; MasteringPhysics does not come packaged with this content. Students, if interested in purchasing this title with MasteringPhysics, ask your instructor for the correct package ISBN and Course ID. Instructors, contact your Pearson representative for more information. If you would like to purchase both the physical text and MasteringPhysics, search for: 0321982584/9780321982582 University Physics with Modern Physics Plus MasteringPhysics with eText -- Access Card Package, 14/e Package consists of: 0321973615/ 9780321973610 University Physics with Modern Physics, 14/e 0321997751/ 9780321997753 MasteringPhysics with Pearson eText -- ValuePack Access Card -- for University Physics with Modern Physics, 14/e For courses in calculus-based physics. The benchmark for clarity and rigor, influenced by the latest in education research. Since its first edition, University Physics has been revered for its emphasis on fundamental principles and how to apply them. This text is known for its clear and thorough narrative, as well as its uniquely broad, deep, and thoughtful sets of worked examples that provide students with key tools for developing both conceptual understanding and problem-solving skills. The Fourteenth Edition improves the defining features of the text while adding new features influenced by education research to teach the skills needed by today's students. A focus on visual learning, new problem types, and pedagogy informed by MasteringPhysics metadata headline the improvements designed to create the best learning resource for physics students. Also available with MasteringPhysics MasteringPhysics® from Pearson is the leading online homework, tutorial, and assessment system, designed to improve results by engaging students before, during, and after class with powerful content. Instructors ensure students arrive ready to learn by assigning educationally effective content before class and encourage critical thinking and retention with in-class resources such as Learning Catalytics. Students can further master concepts after class through traditional and adaptive homework assignments that provide hints and answer-specific feedback. The Mastering gradebook records scores for all automatically graded assignments in one place, while diagnostic tools give instructors access to rich data to assess student understanding and misconceptions. Mastering brings learning full circle by continuously adapting to each student and making learning more personal than ever--before, during, and after class.","industryIdentifiers":[{"type":"ISBN_10","identifier":"0133978044"},{"type":"ISBN_13","identifier":"9780133978049"}],"pageCount":752,"imageLinks":{"thumbnail":"http://books.google.com/books/content?id=WsjDoQEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"}},"searchInfo":{"textSnippet":"This text is known for its clear and thorough narrative, as well as its uniquely broad, deep, and thoughtful sets of worked examples that provide students with key tools for developing both conceptual understanding and problem-solving ..."}}]},{"items":[{"id":"YFv2pwAACAAJ","volumeInfo":{"title":"Jenney's Second Year Latin","authors":["Charles Jenney","David D. Coffin","Eric C. Baade"],"publisher":"Pearson Prentice Hall","publishedDate":"1990-01-01","description":"Praised by teachers for many years, this format is now easier to manage. Passages are carefully controlled to use only vocabulary and syntax already taught and tested. Reading-skills instruction and translation help prepare students for second-year Latin. Twenty lessons formerly in Level I are now at the beginning of Level II, thereby providing better overall pacing.","industryIdentifiers":[{"type":"ISBN_10","identifier":"013797390X"},{"type":"ISBN_13","identifier":"9780137973903"}],"pageCount":511,"imageLinks":{"thumbnail":"http://books.google.com/books/content?id=YFv2pwAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"}},"searchInfo":{"textSnippet":"Praised by teachers for many years, this format is now easier to manage."}}]},{"items":[{"id":"MhX6bAUUbZYC","volumeInfo":{"title":"Paradise Lost","authors":["John Milton","John Leonard"],"publisher":"Penguin UK","publishedDate":"2003-02-27","description":"Edited with an introduction and notes by John Leonard.","industryIdentifiers":[{"type":"ISBN_13","identifier":"9780140424393"},{"type":"ISBN_10","identifier":"0140424393"}],"pageCount":453,"imageLinks":{"thumbnail":"http://books.google.com/books/content?id=MhX6bAUUbZYC&printsec=frontcover&img=1&zoom=1&source=gbs_api"}},"searchInfo":{"textSnippet":"Edited with an introduction and notes by John Leonard."}}]},{"items":[{"id":"eGpP36O6JskC","volumeInfo":{"title":"The Sonnets","authors":["William Shakespeare"],"publisher":"Penguin","publishedDate":"2001","description":"Presents a collection of sonnets along with essays on Shakespeare's life and the theatrical world during his lifetime.","industryIdentifiers":[{"type":"ISBN_10","identifier":"0140714537"},{"type":"ISBN_13","identifier":"9780140714531"}],"pageCount":164,"imageLinks":{"thumbnail":"http://books.google.com/books/content?id=eGpP36O6JskC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}},"searchInfo":{"textSnippet":"Presents a collection of sonnets along with essays on Shakespeare&#39;s life and the theatrical world during his lifetime."}}]},{"items":[{"id":"6lZcnQEACAAJ","volumeInfo":{"title":"Pride and Prejudice","authors":["Jane Austen","George Saintsbury"],"publishedDate":"1894","description":"\"When Elizabeth Bennet first meets eligible bachelor Fitzwilliam Darcy, she thinks him arrogant and conceited, while he struggles to remain indifferent to her good looks and lively mind. When she later discovers that Darcy has involved himself in the troubled relationship between his friend Bingley and her beloved sister Jane, she is determined to dislike him more than ever\"--Book cover p. [4].","industryIdentifiers":[{"type":"ISBN_10","identifier":"0141439513"},{"type":"ISBN_13","identifier":"9780141439518"}],"pageCount":476,"imageLinks":{"thumbnail":"http://books.google.com/books/content?id=6lZcnQEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"}},"searchInfo":{"textSnippet":"When she later discovers that Darcy has involved himself in the troubled relationship between his friend Bingley and her beloved sister Jane, she is determined to dislike him more than ever&quot;--Book cover p. [4]."}}]},{"items":[{"id":"nTpLDAAAQBAJ","volumeInfo":{"title":"Twelfth Night","authors":["William Shakespeare"],"publisher":"Penguin","publishedDate":"2016-07-05","description":"This legendary Shakespeare series features authoritative and meticulously researched texts paired with scholarship by renowned Shakespeareans. Updated for the 21st century by editors Stephen Orgel of Stanford University and A. R. Braunmuller of UCLA, each book includes an essay on the theatrical world of Shakespeare's time, an introduction to the individual play, and a detailed note on the text used. With all new cover designs, these affordable Shakespeares are perfect for students, teachers, scholars and theatre professionals alike.","industryIdentifiers":[{"type":"ISBN_13","identifier":"9780143128595"},{"type":"ISBN_10","identifier":"0143128590"}],"pageCount":94,"imageLinks":{"thumbnail":"http://books.google.com/books/content?id=nTpLDAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}},"searchInfo":{"textSnippet":"The acclaimed Pelican Shakespeare series, now in a dazzling new series design Winner of the 2016 AIGA + Design Observer 50 Books - 50 Covers competition This edition of Twelfth Night is edited with an introduction by Jonathan Crewe and was ..."}}]},{"items":[{"id":"-TgdDgAAQBAJ","volumeInfo":{"title":"Richard II","authors":["William Shakespeare"],"publisher":"Penguin","publishedDate":"2017","description":"These easy-to-read editions incorporate over thirty years of Shakespeare scholarship undertaken since the original series, edited by Alfred Harbage appeared between 1956 and 1967. With these electrifying new covers, dependable texts, and illuminating essays, the Pelican Shakespeare will remains a valued resource for students, teachers, and theater professionals for many years to come. This edition of Richard II is edited with an introduction by Francis E. Dolan.","industryIdentifiers":[{"type":"ISBN_13","identifier":"9780143130215"},{"type":"ISBN_10","identifier":"0143130218"}],"pageCount":113,"imageLinks":{"thumbnail":"http://books.google.com/books/content?id=-TgdDgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}},"searchInfo":{"textSnippet":"Richard II, who ascended to the throne as a young man, is a regal and stately figure, but he is wasteful in his spending habits, unwise in his choice of counselors, and detached from his country and its common people. -- from Sparknotes."}}]},{"items":[{"id":"G7bbDgAAQBAJ","volumeInfo":{"title":"As You Like It","authors":["William Shakespeare"],"publisher":"Penguin","publishedDate":"2017","description":"The acclaimed Pelican Shakespeare series edited by A. R. Braunmuller and Stephen Orgel The legendary Pelican Shakespeare series features authoritative and meticulously researched texts paired with scholarship by renowned Shakespeareans. Each book includes an essay on the theatrical world of Shakespeare's time, an introduction to the individual play, and a detailed note on the text used. Updated by general editors Stephen Orgel and A. R. Braunmuller, these easy-to-read editions incorporate over thirty years of Shakespeare scholarship undertaken since the original series, edited by Alfred Harbage, appeared between 1956 and 1967. With definitive texts and illuminating essays, the Pelican Shakespeare will remain a valued resource for students, teachers, and theater professionals for many years to come. For more than seventy years, Penguin has been the leading publisher of classic literature in the English-speaking world. With more than 1,700 titles, Penguin Classics represents a global bookshelf of the best works throughout history and across genres and disciplines. Readers trust the series to provide authoritative texts enhanced by introductions and notes by distinguished scholars and contemporary authors, as well as up-to-date translations by award-winning translators.","industryIdentifiers":[{"type":"ISBN_13","identifier":"9780143130239"},{"type":"ISBN_10","identifier":"0143130234"}],"pageCount":144,"imageLinks":{"thumbnail":"http://books.google.com/books/content?id=G7bbDgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}},"searchInfo":{"textSnippet":"Readers trust the series to provide authoritative texts enhanced by introductions and notes by distinguished scholars and contemporary authors, as well as up-to-date translations by award-winning translators."}}]},{"items":[{"id":"FMV_vgAACAAJ","volumeInfo":{"title":"Voix Du Siècle","authors":["Eunice Clark Smith","John K. Savacool"],"publisher":"Harcourt College Pub","publishedDate":"1960","industryIdentifiers":[{"type":"ISBN_10","identifier":"0155950061"},{"type":"ISBN_13","identifier":"9780155950061"}],"pageCount":276}}]},{"items":[{"id":"h5k6DwAAQBAJ","volumeInfo":{"title":"The Landscape of History","authors":["John Lewis Gaddis"],"publisher":"Oxford University Press, USA","publishedDate":"2004","description":"What is history and why should we study it? Is there such a thing as historical truth? Is history a science? One of the most accomplished historians at work today, John Lewis Gaddis, answers these and other questions in this short, witty, and humane book.The Landscape of History provides a searching look at the historian's craft, as well as a strong argument for why a historical consciousness should matter to us today. Gaddis points out that while the historical method is more sophisticated than most historians realize, it doesn't require unintelligible prose to explain. Like cartographers mapping landscapes, historians represent what they can never replicate. In doing so, they combine the techniques of artists, geologists, paleontologists, and evolutionary biologists. Their approaches parallel, in intriguing ways, the new sciences of chaos, complexity, and criticality. They don't much resemble what happens in the social sciences, where the pursuit of independent variables functioning with static systems seems increasingly divorced from the world as we know it. So who's really being scientific and who isn't? This question too is one Gaddis explores, in ways that are certain to spark interdisciplinary controversy. Written in the tradition of Marc Bloch and E.H. Carr, The Landscape of History is at once an engaging introduction to the historical method for beginners, a powerful reaffirmation of it for practitioners, a startling challenge to social scientists, and an effective skewering of post-modernist claims that we can't know anything at all about the past. It will be essential reading for anyone who reads, writes, teaches, or cares about history.","industryIdentifiers":[{"type":"ISBN_13","identifier":"9780195171570"},{"type":"ISBN_10","identifier":"0195171578"}],"pageCount":192,"imageLinks":{"thumbnail":"http://books.google.com/books/content?id=h5k6DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}},"searchInfo":{"textSnippet":"One of the most accomplished historians at work today, John Lewis Gaddis, answers these and other questions in this short, witty, and humane book.The Landscape of History provides a searching look at the historian&#39;s craft, as well as a ..."}}]},{"items":[{"id":"FkDpAQAACAAJ","volumeInfo":{"title":"Pocket Oxford Latin Dictionary","authors":["James Morwood"],"publisher":"OUP Oxford","publishedDate":"2005-06-02","description":"Packed with extra features, this intermediate-level dictionary is designed specifically to fit the needs of today's student. Compact and practical, it covers over 45,000 words and phrases, and includes a guide to Latin grammar, extra notes on difficult words and constructions, and useful appendices on topics such as money, weights and measures. This major new edition replaces ISBN 0-19-860283-9.","industryIdentifiers":[{"type":"ISBN_10","identifier":"019861005X"},{"type":"ISBN_13","identifier":"9780198610052"}],"pageCount":496,"imageLinks":{"thumbnail":"http://books.google.com/books/content?id=FkDpAQAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"}},"searchInfo":{"textSnippet":"This major new edition replaces ISBN 0-19-860283-9."}}]},{"items":[{"id":"YsdylQEACAAJ","volumeInfo":{"title":"Readings in Greek History","authors":["D. Brendan Nagle","Stanley M. Burstein"],"publisher":"OUP USA","publishedDate":"2013-05-23","description":"This book contains a comprehensive selection of historical documents for courses in Greek History and Civilization, and Western Civilization. It includes material dealing with all the major aspects of Greek historical experience: political, social, cultural, intellectual, economic, and technological.","industryIdentifiers":[{"type":"ISBN_10","identifier":"019997845X"},{"type":"ISBN_13","identifier":"9780199978458"}],"pageCount":336,"imageLinks":{"thumbnail":"http://books.google.com/books/content?id=YsdylQEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"}},"searchInfo":{"textSnippet":"This book contains a comprehensive selection of historical documents for courses in Greek History and Civilization, and Western Civilization."}}]},{"items":[{"id":"lNqQpdxPJ8sC","volumeInfo":{"title":"Style","authors":["Joseph M. Williams","Gregory G. Colomb"],"publisher":"University of Chicago Press","publishedDate":"1995","description":"This acclaimed book is a master teacher's tested program for turning clumsy prose into clear, powerful, and effective writing. A logical, expert, easy-to-use plan for achieving excellence in expression, Style offers neither simplistic rules nor endless lists of dos and don'ts. Rather, Joseph Williams explains how to be concise, how to be focused, how to be organized. Filled with realistic examples of good, bad, and better writing, and step-by-step strategies for crafting a sentence or organizing a paragraph, Style does much more than teach mechanics: it helps anyone who must write clearly and persuasively transform even the roughest of drafts into a polished work of clarity, coherence, impact, and personality. \"Buy Williams's book. And dig out from storage your dog-eared old copy of The Elements of Style. Set them side by side on your reference shelf.\"—Barbara Walraff, Atlantic \"Let newcoming writers discover this, and let their teachers and readers rejoice. It is a practical, disciplined text that is also a pleasure to read.\"—Christian Century \"An excellent book....It provides a sensible, well-balanced approach, featuring prescriptions that work.\"—Donald Karzenski, Journal of Business Communication \"Intensive fitness training for the expressive mind.\"—Booklist (The college textbook version, Style: Ten Lessons in Clarity and Grace, 9th edition, is available from Longman. ISBN 9780321479358.)","industryIdentifiers":[{"type":"ISBN_10","identifier":"0226899152"},{"type":"ISBN_13","identifier":"9780226899152"}],"pageCount":208,"imageLinks":{"thumbnail":"http://books.google.com/books/content?id=lNqQpdxPJ8sC&printsec=frontcover&img=1&zoom=1&source=gbs_api"}},"searchInfo":{"textSnippet":"This acclaimed book is a master teacher&#39;s tested program for turning clumsy prose into clear, powerful, and effective writing."}}]},{},{},{"items":[{"id":"7lj5EHcChqYC","volumeInfo":{"title":"Cien años de soledad","authors":["Gabriel García Márquez"],"publisher":"Vintage Books","publishedDate":"2009-09-01","description":"\"Muchos años después, frente al pelotón de fusilamiento, el coronel Aureliano Buendía había de recordar aquella tarde remota en que su padre lo llevó a conocer el hielo\". Con estas palabras empieza una novela ya legendaria en los anales de la literatura universal, una de las aventuras literarias más fascinantes del siglo xx. Millones de ejemplares de Cien años de soledad leídos en todas las lenguas y el Premio Nobel de Literatura coronando una obra que se había abierto paso a \"boca a boca\" --como gusta decir el escritor-- son la más palpable demostración de que la aventura fabulosa de la familia Buendía-Iguarán, con sus milagros, fantasías, obsesiones, tragedias, incestos, adulterios, rebeldías, descubrimientos y condenas, representaba al mismo tiempo el mito y la historia, la tragedia y el amor del mundo entero.","industryIdentifiers":[{"type":"ISBN_13","identifier":"9780307474728"},{"type":"ISBN_10","identifier":"0307474720"}],"pageCount":494,"imageLinks":{"thumbnail":"http://books.google.com/books/content?id=7lj5EHcChqYC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}},"searchInfo":{"textSnippet":"Millones de ejemplares de Cien años de soledad leídos en todas las lenguas y el Premio Nobel de Literatura coronando una obra que se había abierto paso a &quot;boca a boca&quot; --como gusta decir el escritor-- son la más palpable demostración ..."}}]},{},{"items":[{"id":"DV_ctwEACAAJ","volumeInfo":{"title":"Physics","authors":["Douglas C. Giancoli"],"publisher":"Addison-Wesley","publishedDate":"2014","description":"Elegant, engaging, exacting, and concise, Giancoli's Physics: Principles with Applications , Seventh Edition, helps you view the world through eyes that know physics. Giancoli's text is a trusted classic, known for its elegant writing, clear presentation, and quality of content. Using concrete observations and experiences you can relate to, the text features an approach that reflects how science is actually practiced: it starts with the specifics, then moves to the great generalizations and the more formal aspects of a topic to show you why we believe what we believe. Written with the goal of giving you a thorough understanding of the basic concepts of physics in all its aspects, the text uses interesting applications to biology, medicine, architecture, and digital technology to show you how useful physics is to your everyday life and in your future profession. Note: This is just the standalone book.","industryIdentifiers":[{"type":"ISBN_10","identifier":"0321625927"},{"type":"ISBN_13","identifier":"9780321625922"}],"pageCount":1054,"imageLinks":{"thumbnail":"http://books.google.com/books/content?id=DV_ctwEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"}},"searchInfo":{"textSnippet":"Note: This is just the standalone book."}}]},{"items":[{"id":"FbW2PwAACAAJ","volumeInfo":{"title":"College Algebra and Trigonometry","authors":["Mark Dugopolski"],"publisher":"Addison-Wesley Longman","publishedDate":"2009-12-01","description":"Dugopolski's College Algebra and Trigonometry: A Unit Circle Approach, Fifth Edition gives students the essential strategies to help them develop the comprehension and confidence they need to be successful in this course. Students will find enoughcarefully placed learning aids and review tools to help them do the math without getting distracted from their objectives. Regardless of their goals beyond the course, all students will benefit from Dugopolski's emphasis on problem solving and critical thinking, which is enhanced by the addition of nearly 1,000 exercises in this edition.","industryIdentifiers":[{"type":"ISBN_10","identifier":"0321644778"},{"type":"ISBN_13","identifier":"9780321644770"}],"pageCount":860,"imageLinks":{"thumbnail":"http://books.google.com/books/content?id=FbW2PwAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"}},"searchInfo":{"textSnippet":"Regardless of their goals beyond the course, all students will benefit from Dugopolski&#39;s emphasis on problem solving and critical thinking, which is enhanced by the addition of nearly 1,000 exercises in this edition."}}]},{"items":[{"id":"rMrtsgEACAAJ","volumeInfo":{"title":"Campbell Biology","authors":["Jane B. Reece","Lisa A. Urry","Michael L. Cain","Steven A. Wasserman","Robert B. Jackson","Peter V. Minorsky"],"publisher":"Benjamin-Cummings Publishing Company","publishedDate":"2013-10-01","description":"The Tenth Edition of the best-selling text Campbell BIOLOGY helps launch you to success in biology through its clear and engaging narrative, superior pedagogy, and innovative use of art and photos to promote student learning. The Tenth Edition helps you develop a deeper understanding of biology by making connections visually across chapters and building the scientific skills needed for success in upper-level courses. New Make Connections Figures pull together content from different chapters visually, helping you see “big picture” relationships. New Scientific Skills Exercises in every chapter use real data to build key skills needed for biology, including data analysis, graphing, experimental design, and math skills. New examples show you how our ability to sequence DNA and proteins rapidly and inexpensively is transforming every subfield of biology.","industryIdentifiers":[{"type":"ISBN_10","identifier":"0321775651"},{"type":"ISBN_13","identifier":"9780321775658"}],"pageCount":1488,"imageLinks":{"thumbnail":"http://books.google.com/books/content?id=rMrtsgEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"}},"searchInfo":{"textSnippet":"Previous edition: Campbell biology, 2011."}}]},{"items":[{"id":"UqE2G-vQ_HkC","volumeInfo":{"title":"SONAR EN CUBANO","authors":["Cristina García"],"publisher":"Random House Digital, Inc.","publishedDate":"1994","description":"Three generations of the Del Pino family--Cuban expatriates--play out their dreams and dramas in Havana, Brooklyn, and the Cuban seaside in the years between 1972 and 1980. Reprint.","industryIdentifiers":[{"type":"ISBN_13","identifier":"9780345391391"},{"type":"ISBN_10","identifier":"034539139X"}],"pageCount":322,"imageLinks":{"thumbnail":"http://books.google.com/books/content?id=UqE2G-vQ_HkC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}},"searchInfo":{"textSnippet":"Three generations of the Del Pino family--Cuban expatriates--play out their dreams and dramas in Havana, Brooklyn, and the Cuban seaside in the years between 1972 and 1980. Reprint."}}]},{"items":[{"id":"FL8O0mTosVUC","volumeInfo":{"title":"Mystery and Manners","authors":["Flannery O'Connor"],"publisher":"Macmillan","publishedDate":"1969-01","description":"O'Connor discusses such subjects as the art of writing, the techniques for teaching literature, and the importance of religion to the creative artist","industryIdentifiers":[{"type":"ISBN_10","identifier":"0374508046"},{"type":"ISBN_13","identifier":"9780374508043"}],"pageCount":237,"imageLinks":{"thumbnail":"http://books.google.com/books/content?id=FL8O0mTosVUC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}},"searchInfo":{"textSnippet":"O&#39;Connor discusses such subjects as the art of writing, the techniques for teaching literature, and the importance of religion to the creative artist"}}]},{"items":[{"id":"BrdNDG7TTUEC","volumeInfo":{"title":"Justice","authors":["Michael J. Sandel"],"publisher":"Macmillan","publishedDate":"2010-08-17","description":"A Harvard professor assesses the role of justice in today's society as well as the moral responsibilities faced by everyday citizens, weighing a range of issues from euthanasia and abortion to affirmative action and tax structuring. Reprint. A best-selling book.","industryIdentifiers":[{"type":"ISBN_13","identifier":"9780374532505"},{"type":"ISBN_10","identifier":"0374532508"}],"pageCount":308,"imageLinks":{"thumbnail":"http://books.google.com/books/content?id=BrdNDG7TTUEC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}},"searchInfo":{"textSnippet":"A Harvard professor assesses the role of justice in today&#39;s society as well as the moral responsibilities faced by everyday citizens, weighing a range of issues from euthanasia and abortion to affirmative action and tax structuring."}}]},{"items":[{"id":"phbCtPgyWVsC","volumeInfo":{"title":"Whistling Vivaldi: How Stereotypes Affect Us and What We Can Do (Issues of Our Time)","authors":["Claude Steele"],"publisher":"W. W. Norton & Company","publishedDate":"2010-04-12","description":"Through dramatic personal stories, the author shares the experiments and studies that show that exposing subjects to stereotypes, including those applying to race and gender, impairs the subjects' performance in the area affected by the stereotype.","industryIdentifiers":[{"type":"ISBN_13","identifier":"9780393062496"},{"type":"ISBN_10","identifier":"039306249X"}],"pageCount":242,"imageLinks":{"thumbnail":"http://books.google.com/books/content?id=phbCtPgyWVsC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}},"searchInfo":{"textSnippet":"Through dramatic personal stories, the author shares the experiments and studies that show that exposing subjects to stereotypes, including those applying to race and gender, impairs the subjects&#39; performance in the area affected by the ..."}}]},{"items":[{"id":"BIXoGto8gTEC","volumeInfo":{"title":"The Shia Revival: How Conflicts Within Islam Will Shape the Future","authors":["Seyyed Vali Reza Nasr","Vali Nasr"],"publisher":"W. W. Norton & Company","publishedDate":"2007-04-17","description":"Considers the ways in which struggles between the Shia and Sunni in the Middle East will affect the region's future, offering insight into the long-standing, brutal power conflicts between Iran and Saudi Arabia for political and spiritual leadership of the Muslim world. Reprint.","industryIdentifiers":[{"type":"ISBN_13","identifier":"9780393329681"},{"type":"ISBN_10","identifier":"0393329682"}],"pageCount":310,"imageLinks":{"thumbnail":"http://books.google.com/books/content?id=BIXoGto8gTEC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}},"searchInfo":{"textSnippet":"Considers the ways in which struggles between the Shia and Sunni in the Middle East will affect the region&#39;s future, offering insight into the long-standing, brutal power conflicts between Iran and Saudi Arabia for political and spiritual ..."}}]},{"items":[{"id":"rdjg1oEP5FQC","volumeInfo":{"title":"Naked Economics: Undressing the Dismal Science (Fully Revised and Updated)","authors":["Charles Wheelan"],"publisher":"W. W. Norton & Company","publishedDate":"2010-04-19","description":"Seeks to provide an engaging and comprehensive primer to economics that explains key concepts without technical jargon and using common-sense examples.","industryIdentifiers":[{"type":"ISBN_13","identifier":"9780393337648"},{"type":"ISBN_10","identifier":"0393337642"}],"pageCount":354,"imageLinks":{"thumbnail":"http://books.google.com/books/content?id=rdjg1oEP5FQC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}},"searchInfo":{"textSnippet":"Seeks to provide an engaging and comprehensive primer to economics that explains key concepts without technical jargon and using common-sense examples."}}]},{"items":[{"id":"1HrdnQEACAAJ","volumeInfo":{"title":"Buzzed","authors":["Cynthia Kuhn","Scott Swartzwelder","Wilkie Wilson"],"publisher":"W W Norton & Company Incorporated","publishedDate":"2014-08-11","description":"Provides current, factual information about many of the most commonly used and abused drugs, looking at how they affect the brain, their short and long term effects, the highs they produce, and the dangers associated with them.","industryIdentifiers":[{"type":"ISBN_10","identifier":"0393344517"},{"type":"ISBN_13","identifier":"9780393344516"}],"pageCount":385,"imageLinks":{"thumbnail":"http://books.google.com/books/content?id=1HrdnQEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"}},"searchInfo":{"textSnippet":"Provides current, factual information about many of the most commonly used and abused drugs, looking at how they affect the brain, their short and long term effects, the highs they produce, and the dangers associated with them."}}]},{},{"items":[{"id":"cnH1swEACAAJ","volumeInfo":{"title":"Western Civilizations","authors":["Joshua Cole","Carol Symes"],"publisher":"W. W. Norton","publishedDate":"2017-07","description":"The balanced narrative in Western Civilizations has been bolstered with new and current scholarship--highlighting new environmental history, more coverage of Central and Eastern Europe, and increased coverage of European and Muslim relations--making it the most up-to-date and relevant text for students. In addition, Cole and Symes have enhanced their pedagogically innovative text with new History Skills Tutorials, Interactive Instructor's Guide, and Norton InQuizitive for History, making the Nineteenth Edition a more interactive and effective teaching and learning tool.","industryIdentifiers":[{"type":"ISBN_10","identifier":"039361431X"},{"type":"ISBN_13","identifier":"9780393614312"}],"pageCount":656,"imageLinks":{"thumbnail":"http://books.google.com/books/content?id=cnH1swEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"}},"searchInfo":{"textSnippet":"In addition, Cole and Symes have enhanced their pedagogically innovative text with new History Skills Tutorials, Interactive Instructor&#39;s Guide, and Norton InQuizitive for History, making the Nineteenth Edition a more interactive and ..."}}]},{"items":[{"id":"n5yptQEACAAJ","volumeInfo":{"title":"Western Civilizations","authors":["Joshua Cole","Carol Symes"],"publisher":"W. W. Norton","publishedDate":"2017-07","description":"The balanced narrative in Western Civilizations has been bolstered with new and current scholarship--highlighting new environmental history, more coverage of Central and Eastern Europe, and increased coverage of European and Muslim relations--making it the most up-to-date and relevant text for students. In addition, Cole and Symes have enhanced their pedagogically innovative text with new History Skills Tutorials, Interactive Instructor's Guide, and Norton InQuizitive for History, making the Nineteenth Edition a more interactive and effective teaching and learning tool.","industryIdentifiers":[{"type":"ISBN_10","identifier":"0393614328"},{"type":"ISBN_13","identifier":"9780393614329"}],"pageCount":848,"imageLinks":{"thumbnail":"http://books.google.com/books/content?id=n5yptQEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"}},"searchInfo":{"textSnippet":"In addition, Cole and Symes have enhanced their pedagogically innovative text with new History Skills Tutorials, Interactive Instructor&#39;s Guide, and Norton InQuizitive for History, making the Nineteenth Edition a more interactive and ..."}}]},{"items":[{"id":"dynZNAEACAAJ","volumeInfo":{"title":"The Search for Modern China","authors":["Jonathan D. Spence"],"publisher":"W. W. Norton","publishedDate":"2013","description":"Jonathan D. Spence is George Burton Adams Professor of History at Yale University and author of eight acclaimed books on China. Here he has written a very readable history of this fascinating country. \"To understand . . . China's past there is no better place to start than Jonathan D. Spences excellent new book\".--The New York Times Book Review front page review. 136 pages of photographs.","industryIdentifiers":[{"type":"ISBN_10","identifier":"0393920852"},{"type":"ISBN_13","identifier":"9780393920857"}],"pageCount":625,"imageLinks":{"thumbnail":"http://books.google.com/books/content?id=dynZNAEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"}},"searchInfo":{"textSnippet":"The most widely used primary-source reader for the modern China course, thoroughly revised and updated to reflect the new edition of Spence, The Search for Modern China."}}]},{"items":[{"id":"vOu2twEACAAJ","volumeInfo":{"title":"Give Me Liberty!","authors":["Eric Foner"],"publisher":"W W Norton & Company Incorporated","publishedDate":"2007-09","description":"Adopted at over 600 universities, colleges, and schools across the country, Eric Foner's Give Me Liberty! is making a difference in the American history survey course.","industryIdentifiers":[{"type":"ISBN_10","identifier":"0393930270"},{"type":"ISBN_13","identifier":"9780393930276"}],"pageCount":582,"imageLinks":{"thumbnail":"http://books.google.com/books/content?id=vOu2twEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"}},"searchInfo":{"textSnippet":"Adopted at over 600 universities, colleges, and schools across the country, Eric Foner&#39;s Give Me Liberty! is making a difference in the American history survey course."}}]},{"items":[{"id":"A_uCRwAACAAJ","volumeInfo":{"title":"Give Me Liberty!: From 1865","authors":["Eric Foner"],"publisher":"W W Norton & Company Incorporated","publishedDate":"2007-09-27","description":"Adopted at over 600 universities, colleges, and schools across the country, Eric Foner's Give Me Liberty! is making a difference in the American history survey course. Featuring a single author and a single, comprehensive theme, Give Me Liberty! presents American history with unparalleled clarity and coherence. The study tools in the book and the companion print and electronic package ensure student success in the course. The Second Edition builds on the success of the first, retaining the unifying theme of freedom while becoming more comprehensive, and adding stronger coverage of Native American and immigration history. In addition, the pedagogy has been strengthened with new Voices of Freedom paired primary sources in each chapter, chapter-opening chronologies, key terms, and more. Overall the presentation remains concise and crisp, free of the encyclopedic detail that clogs so many other survey textbooks.","industryIdentifiers":[{"type":"ISBN_10","identifier":"0393930289"},{"type":"ISBN_13","identifier":"9780393930283"}],"pageCount":1090,"imageLinks":{"thumbnail":"http://books.google.com/books/content?id=A_uCRwAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"}},"searchInfo":{"textSnippet":"The study tools in the book and the companion print and electronic package ensure student success in the course."}}]},{"items":[{"id":"1-cOMQEACAAJ","volumeInfo":{"title":"The Search for Modern China","authors":["Jonathan D. Spence"],"publisher":"W W Norton & Company Incorporated","publishedDate":"2013","description":"The leading textbook by the leading scholar. This text, the classic introduction to modern China for students and general readers, emerged from Spence's highly successful introductory course at Yale, in which he traced the beginnings of modern China to internal developments beginning in the early 17th century. Strong on social and political history, as well as Chinese culture and its intersections with politics, this paperback is a longstanding leader in the survey course on modern China.","industryIdentifiers":[{"type":"ISBN_10","identifier":"0393934519"},{"type":"ISBN_13","identifier":"9780393934519"}],"pageCount":707,"imageLinks":{"thumbnail":"http://books.google.com/books/content?id=1-cOMQEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"}},"searchInfo":{"textSnippet":"Revised to reflect updates to The Search for Modern China, third edition, this outstanding collection displays a strong blend of social history (pieces dealing with everyday life, family, social networks, and culture) and political history ..."}}]},{"items":[{"id":"Ki-WmAYpkIkC","volumeInfo":{"title":"Common Ground","authors":["J. Anthony Lukas"],"publisher":"Vintage","publishedDate":"1985","description":"Winner of 3 different awards, this is a story of the busing crisis in Boston.","industryIdentifiers":[{"type":"ISBN_13","identifier":"9780394746166"},{"type":"ISBN_10","identifier":"0394746163"}],"pageCount":674,"imageLinks":{"thumbnail":"http://books.google.com/books/content?id=Ki-WmAYpkIkC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}},"searchInfo":{"textSnippet":"Winner of 3 different awards, this is a story of the busing crisis in Boston."}}]},{"items":[{"id":"G-VEFXIxFOYC","volumeInfo":{"title":"Japan, Tradition & Transformation","authors":["Edwin Oldfather Reischauer","Albert M. Craig"],"publisher":"Wadsworth Publishing Company","publishedDate":"1989","industryIdentifiers":[{"type":"ISBN_10","identifier":"0395496969"},{"type":"ISBN_13","identifier":"9780395496961"}],"pageCount":352,"imageLinks":{"thumbnail":"http://books.google.com/books/content?id=G-VEFXIxFOYC&printsec=frontcover&img=1&zoom=1&source=gbs_api"}}}]},{"items":[{"id":"za3mi8MA2OIC","volumeInfo":{"title":"Bhagavad-Gita","authors":["Swami Prabhavananda","Christopher Isherwood"],"publisher":"Univ. Press of Mississippi","publishedDate":"2002-07-01","description":"Shares a Hindu message of faith and inspiration as it discusses the purpose of war, the importance of duty, and the spiritual nature of existence.","industryIdentifiers":[{"type":"ISBN_10","identifier":"0451528441"},{"type":"ISBN_13","identifier":"9780451528445"}],"pageCount":143,"imageLinks":{"thumbnail":"http://books.google.com/books/content?id=za3mi8MA2OIC&printsec=frontcover&img=1&zoom=1&source=gbs_api"}},"searchInfo":{"textSnippet":"Shares a Hindu message of faith and inspiration as it discusses the purpose of war, the importance of duty, and the spiritual nature of existence."}}]},{"items":[{"id":"MNKwAAAAIAAJ","volumeInfo":{"title":"Tan Lejos de Dios","authors":["Ana Castillo"],"publisher":"Penguin","publishedDate":"1999","description":"Tome is a small, outwardly sleepy hamlet in central New Mexico. In Ana Castillo's hands, however, it stands wondrously revealed as a place teeming with life and with all manner of collisions: the past with the present, the real with the supernatural, the comic with the horrific, the Native American with the Latino and the Anglo, and the women with the men. With her talkative, intimate voice and stylistic narrative freedom, Castillo relates the story of two crowded decades in the life of a Chicano family. \"Engaging . . . the author tells an important story and she tells it with inventiveness and verve.\"--Washington Post Book World","industryIdentifiers":[{"type":"OTHER","identifier":"UCSC:32106015782250"}],"pageCount":299,"imageLinks":{"thumbnail":"http://books.google.com/books/content?id=MNKwAAAAIAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"}}}]},{"items":[{"id":"jbY9tAEACAAJ","volumeInfo":{"title":"Why Are All the Black Kids Sitting Together in the Cafeteria?","authors":["Beverly Tatum"],"publisher":"Basic Books","publishedDate":"2003-01-17","description":"The classic, bestselling book on the psychology of racism-now fully revised and updated Walk into any racially mixed high school and you will see Black, White, and Latino youth clustered in their own groups. Is this self-segregation a problem to address or a coping strategy? Beverly Daniel Tatum, a renowned authority on the psychology of racism, argues that straight talk about our racial identities is essential if we are serious about enabling communication across racial and ethnic divides. These topics have only become more urgent as the national conversation about race is increasingly acrimonious. This fully revised edition is essential reading for anyone seeking to understand the dynamics of race in America. \"An unusually sensitive work about the racial barriers that still divide us in so many areas of life.\"-Jonathan Kozol","industryIdentifiers":[{"type":"ISBN_10","identifier":"0465083617"},{"type":"ISBN_13","identifier":"9780465083619"}],"pageCount":320,"imageLinks":{"thumbnail":"http://books.google.com/books/content?id=jbY9tAEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"}},"searchInfo":{"textSnippet":"These topics have only become more urgent as the national conversation about race is increasingly acrimonious. This fully revised edition is essential reading for anyone seeking to understand the dynamics of race in America."}}]},{"items":[{"id":"FNyhjgEACAAJ","volumeInfo":{"title":"It's Even Worse Than It Looks","authors":["Thomas E. Mann","Norman J. Ornstein"],"publishedDate":"2016-04-12","description":"Hyperpartisanship is as old as American democracy. But now, acrimony is not confined to a moment; it’s a permanent state of affairs and has seeped into every part of the political process. Identifying the overriding problems that have led Congress--and the United States--to the brink of institutional collapse, It’s Even Worse Than It Looks profoundly altered the debate about why America’s government has become so dysfunctional. Through a new preface and afterword, Thomas Mann and Norman Ornstein bring the story forward, examining the 2012 presidential campaign and exploring the prospects of a less dysfunctional government. As provocative and controversial as ever, It’s Even Worse Than It Looks will continue to set the terms of our political debate in the years to come.","industryIdentifiers":[{"type":"ISBN_10","identifier":"0465096204"},{"type":"ISBN_13","identifier":"9780465096206"}],"pageCount":272,"imageLinks":{"thumbnail":"http://books.google.com/books/content?id=FNyhjgEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"}},"searchInfo":{"textSnippet":"In this revised edition, the authors bring their seminal book up-to-date in a political environment that is more divided than ever."}}]},{},{"items":[{"id":"K89CuQAACAAJ","volumeInfo":{"title":"Student Solutions Manual to accompany Physics 9e","authors":["John D. Cutnell","Kenneth W. Johnson"],"publisher":"Wiley","publishedDate":"2011-12-13","description":"Cutnell and Johnson's 9th edition of Physics continues to offer material to help the development of conceptual understanding, and show the relevance of physics to readers lives and future careers.","industryIdentifiers":[{"type":"ISBN_10","identifier":"0470879564"},{"type":"ISBN_13","identifier":"9780470879566"}],"pageCount":348,"imageLinks":{"thumbnail":"http://books.google.com/books/content?id=K89CuQAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"}},"searchInfo":{"textSnippet":"Cutnell and Johnson&#39;s 9th edition of Physics continues to offer material to help the development of conceptual understanding, and show the relevance of physics to readers lives and future careers."}}]},{"items":[{"id":"6UzGQgAACAAJ","volumeInfo":{"title":"Abstract Algebra","authors":["I. N. Herstein"],"publisher":"Wiley","publishedDate":"1996-01-15","industryIdentifiers":[{"type":"ISBN_10","identifier":"0471368792"},{"type":"ISBN_13","identifier":"9780471368793"}],"pageCount":272,"imageLinks":{"thumbnail":"http://books.google.com/books/content?id=6UzGQgAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"}},"searchInfo":{"textSnippet":"Providing a concise introduction to abstract algebra, this work unfolds some of the fundamental systems with the aim of reaching applicable, significant results."}}]},{"items":[{"id":"6zDNCgAAQBAJ","volumeInfo":{"title":"Introduction to Special Relativity","authors":["James Hammond Smith"],"publisher":"Courier Corporation","publishedDate":"1965","description":"Concise, well-written treatment of epochal theory of modern physics covers classical relativity and the relativity postulate, time dilation, the twin paradox, momentum and energy, particles of zero mass, electric and magnetic fields and forces and more. Only high school math needed. Replete with examples, ideal for self-study. Introduction. 70 illustrations.","industryIdentifiers":[{"type":"ISBN_13","identifier":"9780486688954"},{"type":"ISBN_10","identifier":"048668895X"}],"pageCount":218,"imageLinks":{"thumbnail":"http://books.google.com/books/content?id=6zDNCgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}},"searchInfo":{"textSnippet":"Concise, well-written treatment of epochal theory of modern physics covers classical relativity and the relativity postulate, time dilation, the twin paradox, momentum and energy, particles of zero mass, electric and magnetic fields and ..."}}]},{"items":[{"id":"xUApj0G0MnwC","volumeInfo":{"title":"Single Variable Calculus: Early Transcendentals","authors":["James Stewart"],"publisher":"Cengage Learning","publishedDate":"2007-01-25","description":"Success in your calculus course starts here! James Stewart’s CALCULUS texts are world-wide best-sellers for a reason: they are clear, accurate, and filled with relevant, real-world examples. With CALCULUS: EARLY TRANCENDENTALS, Sixth Edition, Stewart conveys not only the utility of calculus to help you develop technical competence, but also gives you an appreciation for the intrinsic beauty of the subject. His patient examples and built-in learning aids will help you build your mathematical confidence and achieve your goals in the course! Important Notice: Media content referenced within the product description or the product text may not be available in the ebook version.","industryIdentifiers":[{"type":"ISBN_13","identifier":"9780495011699"},{"type":"ISBN_10","identifier":"049501169X"}],"pageCount":912,"imageLinks":{"thumbnail":"http://books.google.com/books/content?id=xUApj0G0MnwC&printsec=frontcover&img=1&zoom=1&source=gbs_api"}},"searchInfo":{"textSnippet":"Important Notice: Media content referenced within the product description or the product text may not be available in the ebook version."}}]},{"items":[{"id":"K1LyXtlFDbkC","volumeInfo":{"title":"Multivariable Calculus","authors":["James Stewart"],"publisher":"Cengage Learning","publishedDate":"2011-01-01","description":"James Stewart’s CALCULUS texts are widely renowned for their mathematical precision and accuracy, clarity of exposition, and outstanding examples and problem sets. Millions of students worldwide have explored calculus through Stewart’s trademark style, while instructors have turned to his approach time and time again. In the Seventh Edition of MULTIVARIABLE CALCULUS, Stewart continues to set the standard for the course while adding carefully revised content. The patient explanations, superb exercises, focus on problem solving, and carefully graded problem sets that have made Stewart’s texts best-sellers continue to provide a strong foundation for the Seventh Edition. From the most unprepared student to the most mathematically gifted, Stewart’s writing and presentation serve to enhance understanding and build confidence. Important Notice: Media content referenced within the product description or the product text may not be available in the ebook version.","industryIdentifiers":[{"type":"ISBN_13","identifier":"9780538497879"},{"type":"ISBN_10","identifier":"0538497874"}],"pageCount":600,"imageLinks":{"thumbnail":"http://books.google.com/books/content?id=K1LyXtlFDbkC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}},"searchInfo":{"textSnippet":"In the Seventh Edition of MULTIVARIABLE CALCULUS, Stewart continues to set the standard for the course while adding carefully revised content."}}]},{"items":[{"id":"MY2aHCYCTM4C","volumeInfo":{"title":"Where Have All the Soldiers Gone?","authors":["James J. Sheehan"],"publisher":"Houghton Mifflin Harcourt","publishedDate":"2009-01-01","description":"A critical study of the tumultuous history of Europe during the twentieth century analyzes how the continent's repudiation of violence in the wake of World War II has affected the region, led to a rejection of defense budgets in favor of social stability and economic growth, and caused a growing rift between the U.S. and Europe. Reprint.","industryIdentifiers":[{"type":"ISBN_10","identifier":"0547086334"},{"type":"ISBN_13","identifier":"9780547086330"}],"pageCount":284,"imageLinks":{"thumbnail":"http://books.google.com/books/content?id=MY2aHCYCTM4C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}},"searchInfo":{"textSnippet":"A critical study of the tumultuous history of Europe during the twentieth century analyzes how the continent&#39;s repudiation of violence in the wake of World War II has affected the region, led to a rejection of defense budgets in favor of ..."}}]},{"items":[{"id":"V5o2tYL2mmwC","volumeInfo":{"title":"Mas Alla de Mi","authors":["Francisco Jimenez"],"publisher":"Houghton Mifflin Harcourt","publishedDate":"2009","description":"Leaving his home in a migrant community, Francisco sets off for college, carrying memories of years of poverty and prejudice.","industryIdentifiers":[{"type":"ISBN_10","identifier":"0547250312"},{"type":"ISBN_13","identifier":"9780547250311"}],"pageCount":214,"imageLinks":{"thumbnail":"http://books.google.com/books/content?id=V5o2tYL2mmwC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}},"searchInfo":{"textSnippet":"Francisco leaves his home in a migrant community and sets off for college, carrying memories of years of poverty and prejudice."}}]},{"items":[{"id":"YjDEAAAACAAJ","volumeInfo":{"title":"Dictionnaire Anglais Et Français","authors":["Roger J. Steiner"],"publisher":"Bantam Books","publishedDate":"1988-12-01","description":"Offers the French and English equivalents for more than eighty-five thousand entries","industryIdentifiers":[{"type":"ISBN_10","identifier":"0553274112"},{"type":"ISBN_13","identifier":"9780553274110"}],"pageCount":752,"imageLinks":{"thumbnail":"http://books.google.com/books/content?id=YjDEAAAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"}},"searchInfo":{"textSnippet":"Offers the French and English equivalents for more than eighty-five thousand entries"}}]},{},{},{"items":[{"id":"L-QLXnX16kAC","volumeInfo":{"title":"Fires of Hatred","authors":["Norman M. Naimark"],"publisher":"Harvard University Press","publishedDate":"2002","description":"Traces the history of ethnic cleansing and its relationship to genocide and population transfer, illustrating why the practice has grown in incidence in the twentieth century as modern states and societies continue to organize themselves by ethnic criteria.","industryIdentifiers":[{"type":"ISBN_10","identifier":"0674009940"},{"type":"ISBN_13","identifier":"9780674009943"}],"pageCount":248,"imageLinks":{"thumbnail":"http://books.google.com/books/content?id=L-QLXnX16kAC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}},"searchInfo":{"textSnippet":"Traces the history of ethnic cleansing and its relationship to genocide and population transfer, illustrating why the practice has grown in incidence in the twentieth century as modern states and societies continue to organize themselves by ..."}}]},{"items":[{"id":"foSLDQAAQBAJ","volumeInfo":{"title":"Invisible Man","authors":["Ralph Ellison"],"publisher":"Vintage","publishedDate":"1952","description":"An African-American man's search for success and the American dream leads him out of college to Harlem and a growing sense of personal rejection and social invisibility. Reissue. 30,000 first printing.","industryIdentifiers":[{"type":"ISBN_13","identifier":"9780679732761"},{"type":"ISBN_10","identifier":"0679732764"}],"pageCount":439,"imageLinks":{"thumbnail":"http://books.google.com/books/content?id=foSLDQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}},"searchInfo":{"textSnippet":"An African-American man&#39;s search for success and the American dream leads him out of college to Harlem and a growing sense of personal rejection and social invisibility. Reissue. 30,000 first printing."}}]},{"items":[{"id":"9LlpAAAAMAAJ","volumeInfo":{"title":"El beso de la mujer arana","authors":["Manuel Puig"],"publisher":"Vintage","publishedDate":"1976","description":"'El beso de la mujer arana' es una elegante y fascinante novela sobre el amor y la victimizacion. En una carcel argentina, dos hombres comparten una celda - Molina, un disenador de escaparates homosexual que es egoista, auto-denigrante y al mismo tiempo encantador; y Valentin, un revolucionario articulado y ferozmente dogmatico obsesionado con la memoria de la mujer que abandono por la causa. Ambos son gradualmente transformados por su cautelosa pero creciente amistad y por la obsesion de Molina con la fantasia y el romance del cine.","industryIdentifiers":[{"type":"OTHER","identifier":"UOM:39015032275862"}],"pageCount":286,"imageLinks":{"thumbnail":"http://books.google.com/books/content?id=9LlpAAAAMAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"}},"searchInfo":{"textSnippet":"&#39;El beso de la mujer arana&#39; es una elegante y fascinante novela sobre el amor y la victimizacion."}}]},{"items":[{"id":"GbQMAAAAYAAJ","volumeInfo":{"title":"Cuando era puertorriqueña","authors":["Esmeralda Santiago"],"publisher":"Vintage Espanol","publishedDate":"1994","description":"La historia de Esmeralda Santiago comienza en la parte rural de Puerto Rico, donde sus padres y siete hermanos, en continuas luchas los unos con los otros, vivían una vida alborotada pero llena de amor y ternura. De niña, Esmeralda aprendió a apreciar cómo se come una guayaba, a distinguir la canción del coquí, a identificar los ingredientes en las morcillas y a ayudar a que el alma de un bebé muerto subiera al Cielo. Pero precisamente cuando Esmeralda parecía haberlo aprendido todo sobre su cultura, la llevaron a Nueva York, donde las reglas --y el idioma-- eran no sólo diferentes, sino también desconcertantes. Cómo Esmeralda superó la adversidad, se ganó entrada a la Performing Arts High School y después continuó a Harvard, de donde se graduó con altos honores, es el relato de la tremenda trayectoria de una mujer verdaderamente extraordinaria.","industryIdentifiers":[{"type":"OTHER","identifier":"UTEXAS:059173001214605"}],"pageCount":296,"imageLinks":{"thumbnail":"http://books.google.com/books/content?id=GbQMAAAAYAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"}},"searchInfo":{"textSnippet":"La historia de Esmeralda Santiago comienza en la parte rural de Puerto Rico, donde sus padres y siete hermanos, en continuas luchas los unos con los otros, vivían una vida alborotada pero llena de amor y ternura."}}]},{"items":[{"id":"KM5tlvpcti0C","volumeInfo":{"title":"Dora","authors":["Sigmund Freud"],"publisher":"Simon and Schuster","publishedDate":"1997-11","description":"An appealing and intelligent eighteen-year-old girl to whom Freud gives the pseudonym \"Dora\" is the subject of a case history that has all the intrigue and unexpected twists of a first-rate detective novel. Freud pursues the secrets of Dora's psyche by using as clues her nervous mannerisms, her own reports on the peculiarities of her family, and the content of her dreams. The personalities involved in Dora's disturbed emotional life were, in their own ways, as complex as she: an obsessive mother, an adulterous father, her father's mistress, Frau K., and Frau K.'s husband, who had made amorous advances toward Dora. Faced with the odd behavior of her family and friends, and unable to confront her own forbidden sexual desires, Dora falls into the destructive pattern of a powerful hysteria. in this influential and provocative case history, Freud uses all his analytic genius and literary skill to reveal Dora's inner life and explain the motives behind her fixation on her father's mistress. -- from back cover.","industryIdentifiers":[{"type":"ISBN_13","identifier":"9780684829463"},{"type":"ISBN_10","identifier":"0684829460"}],"pageCount":124,"imageLinks":{"thumbnail":"http://books.google.com/books/content?id=KM5tlvpcti0C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}},"searchInfo":{"textSnippet":"An appealing and intelligent eighteen-year-old girl to whom Freud gives the pseudonym &quot;Dora&quot; is the subject of a case history that has all the intrigue and unexpected twists of a first-rate detective novel."}}]},{"items":[{"id":"Z1MLXfhCFDAC","volumeInfo":{"title":"Empires in World History","authors":["Jane Burbank","Frederick Cooper"],"publisher":"Princeton University Press","publishedDate":"2011-07-05","description":"This book \"departs from conventional European and nation-centered perspectives to take a remarkable look at how empires relied on diversity to shape the global order. Beginning with ancient Rome and China and continuing across Asia, Europe, the Americas, and Africa,\" the authors \"examine empires' conquests, rivalries, and strategies of domination, emphasizing how empires accommodated, created, and manipulated differences among populations.\"--Jacket.","industryIdentifiers":[{"type":"ISBN_13","identifier":"9780691152363"},{"type":"ISBN_10","identifier":"0691152365"}],"pageCount":511,"imageLinks":{"thumbnail":"http://books.google.com/books/content?id=Z1MLXfhCFDAC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}},"searchInfo":{"textSnippet":"This book &quot;departs from conventional European and nation-centered perspectives to take a remarkable look at how empires relied on diversity to shape the global order."}}]},{"items":[{"id":"I9VEAwAAQBAJ","volumeInfo":{"title":"Congressional Odyssey","authors":["T. R. Reid"],"publisher":"Macmillan","publishedDate":"1980","description":"The two year progress of an inland waterway user charge bill is followed through both houses of Congress, as an example of how legislation is created and passed","industryIdentifiers":[{"type":"ISBN_13","identifier":"9780716711728"},{"type":"ISBN_10","identifier":"0716711729"}],"pageCount":140,"imageLinks":{"thumbnail":"http://books.google.com/books/content?id=I9VEAwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}},"searchInfo":{"textSnippet":"The two year progress of an inland waterway user charge bill is followed through both houses of Congress, as an example of how legislation is created and passed"}}]},{"items":[{"id":"B_35mwS1ZI8C","volumeInfo":{"title":"The Creative Habit","authors":["Twyla Tharp","Mark Reiter"],"publisher":"Simon and Schuster","publishedDate":"2006","description":"A guide to unlocking creative potential provides exercises, anecdotes, and advice for evaluating one's creative history, finding creative stimulation through activity, and making time for creative change.","industryIdentifiers":[{"type":"ISBN_13","identifier":"9780743235273"},{"type":"ISBN_10","identifier":"0743235274"}],"pageCount":243,"imageLinks":{"thumbnail":"http://books.google.com/books/content?id=B_35mwS1ZI8C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}},"searchInfo":{"textSnippet":"A guide to unlocking creative potential provides exercises, anecdotes, and advice for evaluating one&#39;s creative history, finding creative stimulation through activity, and making time for creative change."}}]},{"items":[{"id":"FUIKAAAACAAJ","volumeInfo":{"title":"La grammaire à l'œuvre","authors":["John Barson"],"publisher":"Heinle & Heinle Pub","publishedDate":"2003-11-01","description":"This classic review of French grammar is written all in French, from the point of view of English-speaking learners and now includes access to QUIA online activities.","industryIdentifiers":[{"type":"ISBN_10","identifier":"0759398097"},{"type":"ISBN_13","identifier":"9780759398092"}],"pageCount":384,"imageLinks":{"thumbnail":"http://books.google.com/books/content?id=FUIKAAAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"}},"searchInfo":{"textSnippet":"This classic review of French grammar is written all in French, from the point of view of English-speaking learners and now includes access to QUIA online activities."}}]},{"items":[{"id":"iW8pDwAAQBAJ","volumeInfo":{"title":"The World of Yesterday","authors":["Stefan Zweig"],"publisher":"U of Nebraska Press","publishedDate":"2013-05","description":"By the author who inspired Wes Anderson’s film, The Grand Budapest Hotel Written as both a recollection of the past and a warning for future generations, The World of Yesterday recalls the golden age of literary Vienna—its seeming permanence, its promise, and its devastating fall. Surrounded by the leading literary lights of the epoch, Stefan Zweig draws a vivid and intimate account of his life and travels through Vienna, Paris, Berlin, and London, touching on the very heart of European culture. His passionate, evocative prose paints a stunning portrait of an era that danced brilliantly on the edge of extinction. This new translation by award-winning Anthea Bell captures the spirit of Zweig’s writing in arguably his most revealing work.","industryIdentifiers":[{"type":"ISBN_13","identifier":"9780803226616"},{"type":"ISBN_10","identifier":"0803226616"}],"pageCount":472,"imageLinks":{"thumbnail":"http://books.google.com/books/content?id=iW8pDwAAQBAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"}},"searchInfo":{"textSnippet":"The World of Yesterday is the memoir of Austrian writer Stefan Zweig. It is considered the most famous book on the Habsburg Empire."}}]},{"items":[{"id":"Y44CywAACAAJ","volumeInfo":{"title":"The Student's Catullus","authors":["Gaius Valerius Catullus","Daniel H. Garrison"],"publishedDate":"2012-01-01","description":"Although his audacious, erotic, and satirical verses survived the Middle Ages in only a single copy, Catullus has become in our time a canonical author, ranking in popularity and importance with Virgil, Horace, and Ovid. And for students and teachers of Latin, Daniel H. Garrison's The Student's Catullus is a definitive introductory text. This fourth edition, thoroughly revised, makes Catullus' famous poems more accessible than ever. A comprehensive reference, The Student's Catullus includes the following features: · A brief overview of Catullus's life and artistic persona · A fresh recension of all 113 poems · A commentary in English on each poem, explaining difficult points of Latin and salient aspects of Catullus' artistry · A Who's Who of the people in Catullus' poems · An explanation of Catullan meters · A glossary of literary terms used in the commentary · A complete Latin-English Catullan vocabulary · Six reference maps New to this fourth edition are dozens of additional notes to aid comprehension, more nuanced definitions in the vocabulary list, and amplified information in the appendices. In addition, Garrison has expanded his introduction to include tips for students and teachers. Drawing on years of classroom experience, Garrison urges readers to avoid rote translation and instead engage thoroughly with the poet's delightful language, syntax, structure, and rhythm.","industryIdentifiers":[{"type":"ISBN_10","identifier":"0806142324"},{"type":"ISBN_13","identifier":"9780806142326"}],"pageCount":236,"imageLinks":{"thumbnail":"http://books.google.com/books/content?id=Y44CywAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"}},"searchInfo":{"textSnippet":"And for students and teachers of Latin, Daniel H. Garrison&#39;s The Student&#39;s Catullus is a definitive introductory text. This fourth edition, thoroughly revised, makes Catullus&#39; famous poems more accessible than ever."}}]},{"items":[{"id":"b7j8jgEACAAJ","volumeInfo":{"title":"Changes in the Land","authors":["William Cronon"],"publisher":"Hill and Wang","publishedDate":"1983-07-01","description":"Winner of the Francis Parkman Prize Changes in the Land offers an original and persuasive interpretation of the changing circumstances in New England's plant and animal communities that occurred with the shift from Indian to European dominance. With the tools of both historian and ecologist, Cronon constructs an interdisciplinary analysis of how the land and the people influenced one another, and how that complex web of relationships shaped New England's communities.","industryIdentifiers":[{"type":"ISBN_10","identifier":"0809001586"},{"type":"ISBN_13","identifier":"9780809001583"}],"pageCount":242,"imageLinks":{"thumbnail":"http://books.google.com/books/content?id=b7j8jgEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"}},"searchInfo":{"textSnippet":"Winner of the Francis Parkman Prize Changes in the Land offers an original and persuasive interpretation of the changing circumstances in New England&#39;s plant and animal communities that occurred with the shift from Indian to European ..."}}]},{"items":[{"id":"Pp6d6buqSi4C","volumeInfo":{"title":"Changing Bodies, Changing Lives","authors":["Ruth Bell","Ruth Bell Alexander"],"publisher":"Three Rivers Press","publishedDate":"1998","description":"Percy is incredibly accident-prone, and holds the dubious record of the most accidents. Percy has had a small rivalary with Harold, however, they are always willing to help each other when in trouble.","industryIdentifiers":[{"type":"ISBN_13","identifier":"9780812929904"},{"type":"ISBN_10","identifier":"081292990X"}],"pageCount":411,"imageLinks":{"thumbnail":"http://books.google.com/books/content?id=Pp6d6buqSi4C&printsec=frontcover&img=1&zoom=1&source=gbs_api"}}}]},{"items":[{"id":"vjeHCA6i4IAC","volumeInfo":{"title":"The Lucifer Effect","authors":["Philip G. Zimbardo"],"publisher":"Random House Incorporated","publishedDate":"2008-01","description":"Discusses why people are susceptible to the power of evil, the ability of group dynamics and situational pressures to transform human behavior, the significance of disobedience, and the true nature of heroism.","industryIdentifiers":[{"type":"ISBN_13","identifier":"9780812974447"},{"type":"ISBN_10","identifier":"0812974441"}],"pageCount":551,"imageLinks":{"thumbnail":"http://books.google.com/books/content?id=vjeHCA6i4IAC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}},"searchInfo":{"textSnippet":"Discusses why people are susceptible to the power of evil, the ability of group dynamics and situational pressures to transform human behavior, the significance of disobedience, and the true nature of heroism."}}]},{},{"items":[{"id":"79Lul6PnzUAC","volumeInfo":{"title":"Ovid: Amores, Metamorphoses Selections, 2nd Edition","authors":["Charbra Adams Jestin","Phyllis B. Katz"],"publisher":"Bolchazy-Carducci Publishers","publishedDate":"2000","description":"-- Introduction to Ovid and to each selection -- Latin text based on Loeb text by Goold: Met. 1.452-567; IV 55-166; VIII.183-235; VIII.616-724; X.238-297; and Oxford text by Kenney: Amores I.1, I.3, I.9, I.11 I.12, III.15. -- Translation Questions and","industryIdentifiers":[{"type":"ISBN_13","identifier":"9781610410427"},{"type":"ISBN_10","identifier":"1610410424"}],"pageCount":195,"imageLinks":{"thumbnail":"http://books.google.com/books/content?id=79Lul6PnzUAC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}},"searchInfo":{"textSnippet":"-- Introduction to Ovid and to each selection -- Latin text based on Loeb text by Goold: Met. 1.452-567; IV 55-166; VIII.183-235; VIII.616-724; X.238-297; and Oxford text by Kenney: Amores I.1, I.3, I.9, I.11 I.12, III.15."}}]},{"items":[{"id":"kU2PngEACAAJ","volumeInfo":{"title":"The Essential Iliad","authors":["Homer","Stanley Lombardo"],"publisher":"Hackett Publishing","publishedDate":"2000","description":"While preserving the basic narrative of the Iliad, this selection also highlights the epic's high poetic moments and essential mythological content, and will prove especially useful in surveys of world literature.","industryIdentifiers":[{"type":"ISBN_10","identifier":"0872205428"},{"type":"ISBN_13","identifier":"9780872205420"}],"pageCount":168,"imageLinks":{"thumbnail":"http://books.google.com/books/content?id=kU2PngEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"}},"searchInfo":{"textSnippet":"While preserving the basic narrative of the Iliad, this bare-bones abridgement highlights the epic&#39;s high poetic moments and essential mythological content, and will prove especially useful in surveys of world literature, and in Western ..."}}]},{"items":[{"id":"EJAcmLi2JrcC","volumeInfo":{"title":"Alexander the Great","authors":["James S. Romm","Pamela Mensch"],"publisher":"Hackett Publishing","publishedDate":"2005-03-11","description":"Comprised of relevant selections from the writings of four ancient historians, this volume provides a complete narrative of the important events in the life of Alexander the Great. The Introduction sets these works in historical context, from the conclusion of the Peloponnesian War through Alexander's conquest of Asia, and provides an assessment of Alexander's historical importance, as well as a survey of the central controversies surrounding his personality, aims and intentions. Includes a timeline, maps, bibliography, glossary, and index.","industryIdentifiers":[{"type":"ISBN_13","identifier":"9780872207271"},{"type":"ISBN_10","identifier":"0872207277"}],"pageCount":224,"imageLinks":{"thumbnail":"http://books.google.com/books/content?id=EJAcmLi2JrcC&printsec=frontcover&img=1&zoom=1&source=gbs_api"}},"searchInfo":{"textSnippet":"Comprised of relevant selections from the writings of four ancient historians, this volume provides a complete narrative of the important events in the life of Alexander the Great."}}]},{"items":[{"id":"JocEfO__dvYC","volumeInfo":{"title":"Mieux Écrire en Français","authors":["Michèle R. Morris"],"publisher":"Georgetown University Press","publishedDate":"1988","description":"This expanded edition serves as a comprehensive reference guide as well as a systematic, learner-centered approach for native English-speaking students. The author addresses the most common problems of writing in French, and progresses from words to sentences to paragraphs to the elaboration of accurate and authentic expository prose.","industryIdentifiers":[{"type":"ISBN_10","identifier":"087840225X"},{"type":"ISBN_13","identifier":"9780878402250"}],"pageCount":308,"imageLinks":{"thumbnail":"http://books.google.com/books/content?id=JocEfO__dvYC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}},"searchInfo":{"textSnippet":"This expanded edition serves as a comprehensive reference guide as well as a systematic, learner-centered approach for native English-speaking students."}}]},{"items":[{"id":"9XWeoAEACAAJ","volumeInfo":{"title":"Integrated Chinese: Textbook","publishedDate":"2010","industryIdentifiers":[{"type":"ISBN_10","identifier":"0887276792"},{"type":"ISBN_13","identifier":"9780887276798"}],"imageLinks":{"thumbnail":"http://books.google.com/books/content?id=9XWeoAEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"}}}]},{"items":[{"id":"TO2APwAACAAJ","volumeInfo":{"title":"中文听说读写","authors":["Yuehua Liu"],"publishedDate":"2010","industryIdentifiers":[{"type":"ISBN_10","identifier":"0887276830"},{"type":"ISBN_13","identifier":"9780887276835"}],"pageCount":201,"imageLinks":{"thumbnail":"http://books.google.com/books/content?id=TO2APwAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"}},"searchInfo":{"textSnippet":"The third edition of this time-tested series has been fully up dated to meet the needs of todays students with new communicative and interactive exercises, a full-color design, up-to-date vocabulary, enhanced cultural coverage, a diverse ..."}}]},{"items":[{"id":"6jNLPwAACAAJ","volumeInfo":{"title":"Calculus","authors":["Michael Spivak"],"publisher":"Publish or Perish, Incorporated","publishedDate":"2008-01-01","industryIdentifiers":[{"type":"ISBN_10","identifier":"0914098918"},{"type":"ISBN_13","identifier":"9780914098911"}],"pageCount":680}}]},{},{"items":[{"id":"xqio_Xn4t7oC","volumeInfo":{"title":"Elementary and Intermediate Algebra","authors":["Alan S. Tussy","R. David Gustafson"],"publisher":"Cengage Learning","publishedDate":"2012-01-01","description":"The main focus of ELEMENTARY AND INTERMEDIATE ALGEBRA, 5e, is to address the fundamental needs of today's developmental math students. Offering a uniquely modern, balanced program, ELEMENTARY AND INTERMEDIATE ALGEBRA, 5e, integrates conceptual understanding with traditional skill and practice reinforced through visual and interactive practice in Enhanced WebAssign, available exclusively from Cengage Learning. By helping students understand the language of algebra and the why behind problem solving through instructional approaches and worked examples, they are better equipped to succeed at the how. Practice is essential in making these connections and it is emphasized in ELEMENTARY AND INTERMEDIATE ALGEBRA, 5e, with additional practice problems both in the text and Enhanced WebAssign. Give your students confidence by showing them how Algebra is not just about the x it's also about the WHY. Important Notice: Media content referenced within the product description or the product text may not be available in the ebook version.","industryIdentifiers":[{"type":"ISBN_13","identifier":"9781111567682"},{"type":"ISBN_10","identifier":"1111567689"}],"pageCount":1280,"imageLinks":{"thumbnail":"http://books.google.com/books/content?id=xqio_Xn4t7oC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}},"searchInfo":{"textSnippet":"Practice is essential in making these connections and it is emphasized in ELEMENTARY AND INTERMEDIATE ALGEBRA, 5e, with additional practice problems both in the text and Enhanced WebAssign."}}]},{"items":[{"id":"bbwTCgAAQBAJ","volumeInfo":{"title":"Discovering the Western Past, Volume II: Since 1500","authors":["Merry E. Wiesner-Hanks","Andrew Evans","William Bruce Wheeler","Julius Ruff"],"publisher":"Cengage Learning","publishedDate":"2014-01-01","description":"This successful Western history version of the popular Discovering series provides a broad range of both visual and written sources. The unique pedagogical framework includes The Problem, Sources and Method, The Evidence, Questions to Consider, and Epilogue and Evaluation sections in each chapter. This structure promotes critical thinking, sharpens analytical skills, and builds student interest in the subject matter. DISCOVERING THE WESTERN PAST: A LOOK AT THE EVIDENCE, Volume II: Since 1500, Seventh Edition, emphasizes historical study as interpretation rather than memorization of data, with actual documents and artifacts from which students develop answers to historical questions--and learn to think like historians. Significantly revised, this edition includes four new chapters: “Royal Power and Overseas Expansion, 1450-1540” (Ch. 2); “Motherhood, Nationalism, and Women’s Political Role, 1848-1940” (Ch. 10); “Cold War Cultures: Visions of the ’Good Life’ in East and West” (Ch. 13); and “Europe and the Iraq War” (Ch. 14). Important Notice: Media content referenced within the product description or the product text may not be available in the ebook version.","industryIdentifiers":[{"type":"ISBN_13","identifier":"9781111837174"},{"type":"ISBN_10","identifier":"1111837171"}],"pageCount":448,"imageLinks":{"thumbnail":"http://books.google.com/books/content?id=bbwTCgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}},"searchInfo":{"textSnippet":"Significantly revised, this edition includes four new chapters: “Royal Power and Overseas Expansion, 1450-1540” (Ch. 2); “Motherhood, Nationalism, and Women&#39;s Political Role, 1848-1940” (Ch. 10); “Cold War Cultures: Visions of the ..."}}]},{"items":[{"id":"PUX3rQEACAAJ","volumeInfo":{"title":"Student Solutions Manual for Chemistry","authors":["Raymond Chang","Kenneth Goldsby"],"publisher":"McGraw-Hill Science/Engineering/Math","publishedDate":"2015-03-06","description":"The Student Solutions Manual is written by Raymond Chang and Ken Goldsby. This supplement contains detailed solutions and explanations for even-numbered problems in the main text. The manual also includes a detailed discussion of different types of problems and approaches to solving chemical problems and tutorial solutions for many of the end-of-chapter problems in the text, along with strategies for solving them. Note that solutions to the problems listed under Interpreting, Modeling & Estimating are not provided in the manual.","industryIdentifiers":[{"type":"ISBN_10","identifier":"1259286223"},{"type":"ISBN_13","identifier":"9781259286223"}],"pageCount":672,"imageLinks":{"thumbnail":"http://books.google.com/books/content?id=PUX3rQEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"}},"searchInfo":{"textSnippet":"The Student Solutions Manual is written by Raymond Chang and Ken Goldsby. This supplement contains detailed solutions and explanations for even-numbered problems in the main text."}}]},{"items":[{"id":"5B4xuAEACAAJ","volumeInfo":{"title":"Single Variable Calculus: Early Transcendentals","authors":["James Stewart"],"publisher":"Cengage Learning","publishedDate":"2015-01-01","description":"James Stewart’s CALCULUS: EARLY TRANSCENDENTALS texts are widely renowned for their mathematical precision and accuracy, clarity of exposition, and outstanding examples and problem sets. Millions of students worldwide have explored calculus through Stewart’s trademark style, while instructors have turned to his approach time and time again. In the Eighth Edition of SINGLE VARIABLE CALCULUS: EARLY TRANSCENDENTALS, Stewart continues to set the standard for the course while adding carefully revised content. The patient explanations, superb exercises, focus on problem solving, and carefully graded problem sets that have made Stewart’s texts best-sellers continue to provide a strong foundation for the Eighth Edition. From the most unprepared student to the most mathematically gifted, Stewart’s writing and presentation serve to enhance understanding and build confidence. Important Notice: Media content referenced within the product description or the product text may not be available in the ebook version.","industryIdentifiers":[{"type":"ISBN_10","identifier":"1305270339"},{"type":"ISBN_13","identifier":"9781305270336"}],"pageCount":960,"imageLinks":{"thumbnail":"http://books.google.com/books/content?id=5B4xuAEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"}},"searchInfo":{"textSnippet":"In the Eighth Edition of SINGLE VARIABLE CALCULUS: EARLY TRANSCENDENTALS, Stewart continues to set the standard for the course while adding carefully revised content."}}]},{"items":[{"id":"6h5TCwAAQBAJ","volumeInfo":{"title":"Student Solutions Manual for Stewart S Single Variable Calculus: Early Transcendentals, 8th","authors":["Daniel Anderson","Jeffrey A. Cole","Daniel Drucker","James Stewart"],"publisher":"Cengage Learning","publishedDate":"2015-07-03","description":"Contains fully worked-out solutions to all of the odd-numbered exercises in the text, giving students a way to check their answers and ensure that they took the correct steps to arrive at an answer.","industryIdentifiers":[{"type":"ISBN_13","identifier":"9781305272422"},{"type":"ISBN_10","identifier":"1305272420"}],"pageCount":576,"imageLinks":{"thumbnail":"http://books.google.com/books/content?id=6h5TCwAAQBAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"}},"searchInfo":{"textSnippet":"Contains fully worked-out solutions to all of the odd-numbered exercises in the text, giving students a way to check their answers and ensure that they took the correct steps to arrive at an answer."}}]},{},{"items":[{"id":"MeeMQAAACAAJ","volumeInfo":{"title":"A Short History of Iraq","authors":["Thabit Abdullah"],"publisher":"Prentice Hall","publishedDate":"2011","description":"This accessible guide has been fully updated to take into account the Iraq War and subsequent developments, whilst retaining its character as a non-partisan and approachable text for students and interested readers alike. The twentieth century witnessed the transformation of the area known currently as Iraq from a backward region of the Ottoman Empire, to one of the most important and dynamic states in the Middle East. The rise of modern Iraq has its roots in the second half of the nineteenth century when Ottoman reforms led to gradual state modernization and increasing integration in the World Economy. British control after World War I was one of the determining factors in the establishment of the current borders of the country and the nature of its subsequent national identity. The other important factor was the highly heterogeneous nature of Iraqi society being divided along tribal, ethnic, religious, and sectarian lines. This book focuses on the interaction between the old and the new, or between continuity and change, as it is manifested in the nature of social development, nation-building, the state and the political opposition. An entirely new chapter focusing on the recent conflict has been added, and will contain sections on: The new chapter will have the following sections: The Question of American Intervention Invasion and the Fall of Saddam Looting & the Collapse of the Central State The Provisional Authority?s Reforms The Nature of the Resistance Iraq?s New Political Reality Elections and the Rise of Sectarian Parties Social-Economic Transformations The Challenge of the Future.","industryIdentifiers":[{"type":"ISBN_10","identifier":"1405859377"},{"type":"ISBN_13","identifier":"9781405859370"}],"pageCount":191,"imageLinks":{"thumbnail":"http://books.google.com/books/content?id=MeeMQAAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"}},"searchInfo":{"textSnippet":"In this new edition, &quot;A Short History of Iraq&quot; has been fully revised throughout and now includes a new final chapter covering the seven years since the beginning of the Iraq war."}}]},{},{},{"items":[{"id":"vDIPogEACAAJ","volumeInfo":{"title":"Psychology","authors":["David G. Myers","C. Nathan DeWall"],"publisher":"Worth Publishers","publishedDate":"2015-01-12","description":"David Myers’ new partnership with coauthor C. Nathan DeWall matches two dedicated educators and scholars, each passionate about teaching psychological science through writing and interactive media. With this new edition of the #1 bestselling Psychology, Myers and DeWall take full advantage of what an integrated text/media learning combination can do. New features move students from reading the chapter to actively learning online: How Would You Know puts students in the role of scientific researcher and includes tutorials on key research design principles; Assess Your Strengths self-tests help students learn a little more about themselves, and include tips about nurturing key strengths. These and other innovations rest on the same foundations that have always distinguished a new David Myers edition—exhaustive updating (hundreds of new citations), captivating writing, and the merging of rigorous science with a broad human perspective that engages both the mind and heart. This edition of Psychology is accompanied by its own dedicated version of Worth Publishers’ breakthrough online course space, featuring a fully integrated e-Book, LearningCurve adaptive quizzing, a rich collection of student media resources, and easy setup, assessment, and course management options for instructors.","industryIdentifiers":[{"type":"ISBN_10","identifier":"1464140812"},{"type":"ISBN_13","identifier":"9781464140815"}],"pageCount":912,"imageLinks":{"thumbnail":"http://books.google.com/books/content?id=vDIPogEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"}},"searchInfo":{"textSnippet":"David Myers&#39; new partnership with coauthor C. Nathan DeWall matches two dedicated educators and scholars, each passionate about teaching psychological science through writing and interactive media."}}]},{"items":[{"id":"zIK9oAEACAAJ","volumeInfo":{"title":"Introduction to the Practice of Statistics","authors":["David S. Moore","George P. McCabe","Bruce A. Craig"],"publisher":"W H Freeman & Company","publishedDate":"2014-02-07","description":"With this updated new edition, the market-leading Introduction to the Practice of Statistics (IPS) remains unmatched in its ability to show how statisticians actually work. Its focus on data analysis and critical thinking, step-by-step pedagogy, and applications in a variety of professions and disciplines make it exceptionally engaging to students learning core statistical ideas.","industryIdentifiers":[{"type":"ISBN_10","identifier":"1464158932"},{"type":"ISBN_13","identifier":"9781464158933"}],"pageCount":718,"imageLinks":{"thumbnail":"http://books.google.com/books/content?id=zIK9oAEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"}},"searchInfo":{"textSnippet":"With this updated new edition, the market-leading Introduction to the Practice of Statistics (IPS) remains unmatched in its ability to show how statisticians actually work."}}]},{"items":[{"id":"OsrNCwAAQBAJ","volumeInfo":{"title":"Our Kids","authors":["Robert D. Putnam"],"publisher":"Simon and Schuster","publishedDate":"2016-03-29","description":"A New York Times bestseller and “a passionate, urgent” (The New Yorker) examination of the growing inequality gap from the bestselling author of Bowling Alone: why fewer Americans today have the opportunity for upward mobility. Central to the very idea of America is the principle that we are a nation of opportunity. But over the last quarter century we have seen a disturbing “opportunity gap” emerge. We Americans have always believed that those who have talent and try hard will succeed, but this central tenet of the American Dream seems no longer true or at the least, much less true than it was. In Our Kids, Robert Putnam offers a personal and authoritative look at this new American crisis, beginning with the example of his high school class of 1959 in Port Clinton, Ohio. The vast majority of those students went on to lives better than those of their parents. But their children and grandchildren have faced diminishing prospects. Putnam tells the tale of lessening opportunity through poignant life stories of rich, middle class, and poor kids from cities and suburbs across the country, brilliantly blended with the latest social-science research. “A truly masterful volume” (Financial Times), Our Kids provides a disturbing account of the American dream that is “thoughtful and persuasive” (The Economist). Our Kids offers a rare combination of individual testimony and rigorous evidence: “No one can finish this book and feel complacent about equal opportunity” (The New York Times Book Review).","industryIdentifiers":[{"type":"ISBN_13","identifier":"9781476769905"},{"type":"ISBN_10","identifier":"1476769907"}],"pageCount":400,"imageLinks":{"thumbnail":"http://books.google.com/books/content?id=OsrNCwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}},"searchInfo":{"textSnippet":"&quot;The bestselling author of Bowling Alone offers [an] ... examination of the American Dream in crisis--how and why opportunities for upward mobility are diminishing, jeopardizing the prospects of an ever larger segment of Americans&quot;--"}}]},{"items":[{"id":"33E8swEACAAJ","volumeInfo":{"title":"Pedro Páramo","authors":["Juan Rulfo"],"publishedDate":"2015","industryIdentifiers":[{"type":"ISBN_10","identifier":"1592328938"},{"type":"ISBN_13","identifier":"9781592328932"}],"pageCount":122}}]},{"items":[{"id":"b3UNmAEACAAJ","volumeInfo":{"title":"The Numbers Game","authors":["Michael Blastland","Andrew Dilnot"],"publisher":"Penguin","publishedDate":"2010-01","description":"Explains how to better understand the world and make more responsible consumer choices using accessible mathematical principles, in a guide that redefines the concepts of averages, risks, and statistics.","industryIdentifiers":[{"type":"ISBN_10","identifier":"1592404855"},{"type":"ISBN_13","identifier":"9781592404858"}],"pageCount":210,"imageLinks":{"thumbnail":"http://books.google.com/books/content?id=b3UNmAEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"}},"searchInfo":{"textSnippet":"Explains how to better understand the world and make more responsible consumer choices using accessible mathematical principles, in a guide that redefines the concepts of averages, risks, and statistics."}}]},{"items":[{"id":"HZFdqjp5pqQC","volumeInfo":{"title":"Rhetoric, Logic, and Argumentation: A Guide for Student Writers","publisher":"Prestwick House Inc","publishedDate":"2010","industryIdentifiers":[{"type":"ISBN_13","identifier":"9781608439737"},{"type":"ISBN_10","identifier":"1608439739"}],"pageCount":107,"imageLinks":{"thumbnail":"http://books.google.com/books/content?id=HZFdqjp5pqQC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}}}]},{"items":[{"id":"hoI0MQAACAAJ","volumeInfo":{"title":"White Working Class","authors":["Joan C. Williams"],"publisher":"Harvard Business School Press","publishedDate":"2017","description":"Around the world, populist movements are gaining traction among the white working class. Meanwhile, the professional elite--journalists, managers, and establishment politicians--is on the outside looking in, and left to argue over the reasons why. InWhite Working Class, Joan C. Williams, described as \"something approaching rock star status” in her field by theNew York Times, explains why so much of the elite’s analysis of the white working class is misguided, rooted in assumptions by what she has controversially coined \"class cluelessness.” Williams explains how most analysts, and the corresponding media coverage, have conflated \"working class” with \"poor.” All too often, white working class motivations have been dismissed as simply racism or xenophobia. Williams explains how the term \"working class” has been misapplied--it is, in fact, the elusive, purportedly disappearing middle class. This demographic often resents both the poor and the professionals. They don’t, however, tend to resent the truly rich, nor are they particularly bothered by income inequality. Their dream is not to join the upper middle class, with its different culture, but to stay true to their own values in their own communities--just with more money. White Working Class is a blunt, bracing narrative that sketches a nuanced portrait of millions of people throughout the world who have proven to be a potent political force. For anyone stunned by the rise in populist, nationalist movements, wondering why so many would seemingly vote against their own economic interests or simply feeling like a stranger in their own country,White Working Class will be a convincing primer on how to connect with a crucial set of workers--and voters.","industryIdentifiers":[{"type":"ISBN_10","identifier":"1633693783"},{"type":"ISBN_13","identifier":"9781633693784"}],"pageCount":112,"imageLinks":{"thumbnail":"http://books.google.com/books/content?id=hoI0MQAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"}},"searchInfo":{"textSnippet":"In White Working Class, Joan C. Williams, described as having &quot;something approaching rock star status&quot; by the New York Times, explains why so much of the elite&#39;s analysis of the white working class is misguided, rooted in class cluelessness ..."}}]},{"items":[{"id":"In6kmAEACAAJ","volumeInfo":{"title":"The Algorithm Design Manual","authors":["Steven S. Skiena"],"publisher":"Springer-Verlag New York Incorporated","publishedDate":"2008","description":"Expanding on the highly successful formula of the first edition, this book now serves as the primary textbook of choice for any algorithm design course while maintaining its status as the premier practical reference guide to algorithms.","industryIdentifiers":[{"type":"ISBN_10","identifier":"1848000693"},{"type":"ISBN_13","identifier":"9781848000698"}],"pageCount":730,"imageLinks":{"thumbnail":"http://books.google.com/books/content?id=In6kmAEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"}},"searchInfo":{"textSnippet":"Expanding on the highly successful formula of the first edition, this book now serves as the primary textbook of choice for any algorithm design course while maintaining its status as the premier practical reference guide to algorithms."}}]},{"items":[{"id":"9c0gPwAACAAJ","volumeInfo":{"title":"你好","authors":["Shumang Fredlein","Paul Fredlein"],"publisher":"Cheng & Tsui Company","publishedDate":"2000-06-01","description":"Ni Hao is a complete Chinese language course for the beginning students of upper primary to senior secondary schools. There are five levels in this series.","industryIdentifiers":[{"type":"ISBN_10","identifier":"1876739061"},{"type":"ISBN_13","identifier":"9781876739065"}],"pageCount":120,"imageLinks":{"thumbnail":"http://books.google.com/books/content?id=9c0gPwAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"}},"searchInfo":{"textSnippet":"Ni Hao is a complete Chinese language course for the beginning students of upper primary to senior secondary schools. There are five levels in this series."}}]},{},{},{},{"items":[{"id":"aRCjbwAACAAJ","volumeInfo":{"title":"A Course in Geometry","authors":["Arthur William Weeks","Jackson B. Adkins"],"publishedDate":"1982","industryIdentifiers":[{"type":"ISBN_10","identifier":"1881764060"},{"type":"ISBN_13","identifier":"9781881764069"}],"pageCount":552,"imageLinks":{"thumbnail":"http://books.google.com/books/content?id=aRCjbwAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"}}}]},{},{"items":[{"id":"o1goAQAAIAAJ","volumeInfo":{"title":"L'étranger","authors":["Albert Camus"],"publisher":"Editions Gallimard","publishedDate":"1942","description":"Quand la sonnerie a encore retenti, que la porte du box s'est ouverte, c'est le silence de la salle qui est monté vers moi, le silence, et cette singulière sensation que j'ai eue lorsque j'ai constaté que le jeune journaliste avait détourné les yeux. Je n'ai pas regardé du côté de Marie. Je n'en ai pas eu le temps parce que le président m'a dit dans une forme bizarre que j'aurais la tête tranchée sur une place publique au nom du peuple français...","industryIdentifiers":[{"type":"OTHER","identifier":"UCSC:32106009590941"}],"pageCount":185,"imageLinks":{"thumbnail":"http://books.google.com/books/content?id=o1goAQAAIAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"}},"searchInfo":{"textSnippet":"Quand la sonnerie a encore retenti, que la porte du box s&#39;est ouverte, c&#39;est le silence de la salle qui est monté vers moi, le silence, et cette singulière sensation que j&#39;ai eue lorsque j&#39;ai constaté que le jeune journaliste avait ..."}}]},{"items":[{"id":"60hmuwAACAAJ","volumeInfo":{"title":"Sept histoires qui reviennent de loin","authors":["Jean-Christophe Rufin"],"publisher":"Editions Gallimard","publishedDate":"2012","description":"Sept histoires fortes, drôles, émouvantes. Sept petits romans avec chacun son intrigue, ses personnages, son dénouement inattendu. Sept lieux du monde, Mozambique, Kirghizie, île Maurice... qui apportent leurs couleurs et leurs parfums. Sept occasions de donner aux grandes questions contemporaines un visage humain. Sept instants de vie. Un même bonheur de lecture.","industryIdentifiers":[{"type":"ISBN_10","identifier":"2070447987"},{"type":"ISBN_13","identifier":"9782070447985"}],"pageCount":184,"imageLinks":{"thumbnail":"http://books.google.com/books/content?id=60hmuwAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"}},"searchInfo":{"textSnippet":"Sept histoires fortes, drôles, émouvantes."}}]},{"items":[{"id":"3RfanAEACAAJ","volumeInfo":{"title":"Madame Bovary","authors":["Gustave Flaubert"],"publishedDate":"1986","description":"Emma maigrit, ses joues pâlirent, sa figure s'allongea. Avec ses bandeaux noirs, ses grands yeux, son nez droit, sa démarche d'oiseau, et toujours silencieuse maintenant, ne semblait-elle pas traverser l'existence en y touchant à peine, et porter au front la vague empreinte de quelque prédestination sublime ? Elle était si triste et si calme, si douce à la fois et si réservée, que l'on se sentait près d'elle pris par un charme glacial, comme l'on frissonne dans les églises sous le parfum des fleurs mêlé au froid des marbres (...) Mais elle était pleine de convoitises, de rage, de haine. Cette robe aux plis droits cachait un cœur bouleversé, et ces lèvres si pudiques n'en racontaient pas la tourmente. Elle était amoureuse...","industryIdentifiers":[{"type":"ISBN_10","identifier":"2080706578"},{"type":"ISBN_13","identifier":"9782080706577"}],"pageCount":539,"imageLinks":{"thumbnail":"http://books.google.com/books/content?id=3RfanAEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"}},"searchInfo":{"textSnippet":"Emma maigrit, ses joues pâlirent, sa figure s&#39;allongea."}}]},{"items":[{"id":"W64_DwAAQBAJ","volumeInfo":{"title":"Les 7 Boules de cristal","authors":["Hergé"],"publisher":"Editions Moulinsart","publishedDate":"1948-01-01","description":"Dans Les 7 Boules de cristal, sept savants sont mystérieusement frappés de léthargie à leur retour d'une expédition dans les Andes. Le professeur Tournesol ayant disparu, Tintin et le Capitaine partent à sa recherche.","industryIdentifiers":[{"type":"ISBN_13","identifier":"9782203001121"},{"type":"ISBN_10","identifier":"2203001127"}],"pageCount":62,"imageLinks":{"thumbnail":"http://books.google.com/books/content?id=W64_DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}},"searchInfo":{"textSnippet":"Dans Les 7 Boules de cristal, sept savants sont mystérieusement frappés de léthargie à leur retour d&#39;une expédition dans les Andes. Le professeur Tournesol ayant disparu, Tintin et le Capitaine partent à sa recherche."}}]},{"items":[{"id":"Xa4_DwAAQBAJ","volumeInfo":{"title":"Le Temple du Soleil","authors":["Hergé"],"publisher":"Editions Moulinsart","publishedDate":"1949-01-01","description":"Tintin, Milou et le Capitaine Haddock s'envolent pour le Pérou à la recherche du professeur Tournesol. Celui-ci a involontairement commis un sacrilège qui le destine au châtiment suprême.","industryIdentifiers":[{"type":"ISBN_13","identifier":"9782203001138"},{"type":"ISBN_10","identifier":"2203001135"}],"pageCount":62,"imageLinks":{"thumbnail":"http://books.google.com/books/content?id=Xa4_DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}},"searchInfo":{"textSnippet":"Tintin, Milou et le Capitaine Haddock s&#39;envolent pour le Pérou à la recherche du professeur Tournesol. Celui-ci a involontairement commis un sacrilège qui le destine au châtiment suprême."}}]},{},{},{},{"items":[{"id":"xJETjwEACAAJ","volumeInfo":{"title":"Aula internacional. Libro del alumno. Con espansione online. Con CD Audio. Per le Scuole superiori","authors":["Jaime Corpas","Agustín Garmendia","Carmen Soriano"],"publisher":"Difusion","publishedDate":"2013","description":"\"'Aula internacional Nueva edición' es una rigurosa actualización de esa propuesta : un manual que mantiene el espíritu inicial, pero que recoge las sugerencias de los usuarios, que renueva su lenguaje gráfico y que incorpora las nuevas tecnologías de la información.\"--Editor.","industryIdentifiers":[{"type":"ISBN_10","identifier":"8415640102"},{"type":"ISBN_13","identifier":"9788415640103"}],"pageCount":215,"imageLinks":{"thumbnail":"http://books.google.com/books/content?id=xJETjwEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"}},"searchInfo":{"textSnippet":"&quot;&#39;Aula internacional Nueva edición&#39; es una rigurosa actualización de esa propuesta : un manual que mantiene el espíritu inicial, pero que recoge las sugerencias de los usuarios, que renueva su lenguaje gráfico y que incorpora las nuevas ..."}}]},{"items":[{"id":"ctbZoAEACAAJ","volumeInfo":{"title":"Aula internacional 3 B1","authors":["Jaime Corpas","Agustin Garmendia"],"publishedDate":"2014","industryIdentifiers":[{"type":"ISBN_10","identifier":"8415640110"},{"type":"ISBN_13","identifier":"9788415640110"}],"pageCount":246}}]},{"items":[{"id":"-L0bogEACAAJ","volumeInfo":{"title":"Aula internacional 1","authors":["Collectif,"],"publishedDate":"2016-05-02","industryIdentifiers":[{"type":"ISBN_10","identifier":"8415846770"},{"type":"ISBN_13","identifier":"9788415846772"}],"pageCount":224,"imageLinks":{"thumbnail":"http://books.google.com/books/content?id=-L0bogEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"}}}]},{},{"items":[{"id":"e_0hcgAACAAJ","volumeInfo":{"title":"Los cachorros","authors":["Mario Vargas Llosa"],"publisher":"Catedra Ediciones","publishedDate":"2010-01-01","description":"Cuando Mario Vargas Llosa publicó Los cachorros en 1967 era ya un escritor consagrado, en su plenitud de narrador. Relato que busca en todo momento una voz plural (según el autor obra más cantada que contada), que ondula de un personaje a otro, de lo subjetivo a lo objetivo, ha suscitado una increíble cantidad de interpretaciones: evocación de juventud, parábola sobre la impotencia de una clase social, castración del artista en el mundo subdesarrollado, y otras muchas. Cualquiera puede ser cierta porque Los cachorros tiene la intensidad y el carácter ambiguo de las grandes obras maestras.","industryIdentifiers":[{"type":"ISBN_10","identifier":"8437627206"},{"type":"ISBN_13","identifier":"9788437627205"}],"pageCount":121,"imageLinks":{"thumbnail":"http://books.google.com/books/content?id=e_0hcgAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"}},"searchInfo":{"textSnippet":"Cuando Mario Vargas Llosa publicó Los cachorros en 1967 era ya un escritor consagrado, en su plenitud de narrador."}}]}]